SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
#include <memory>
#include <fstream>

#include <llvm/CodeGen/MachineFrameInfo.h>
#include "MSP430.h"
#include "llvm/CodeGen/MachineFunctionPass.h"
#include "llvm/CodeGen/TargetInstrInfo.h"
#include "llvm/CodeGen/MachineLoopInfo.h"
#include "llvm/CodeGen/TargetLowering.h"
#include "llvm/CodeGen/MachineInstrBuilder.h"
#include "llvm/ADT/SmallSet.h"

#include "llvm/Support/GraphWriter.h"
#include "llvm/CodeGen/MachineDominators.h"
#include "llvm/CodeGen/MachinePostDominators.h"

using namespace llvm;

#define DEBUG_TYPE "msp430-dma-defender"

// This internal switch can be used to turn off the DMA defender
static cl::opt<bool>
        Enable(DEBUG_TYPE "-enable",
               cl::desc("Enable the MSP430 DMA defender"),
               cl::init(false), cl::Hidden);
static cl::opt<bool>
        EmitCFG(DEBUG_TYPE "-emit-cfg",
                cl::desc("Emit control flow graph (GraphViz)"),
                cl::init(false), cl::Hidden);
static cl::opt<bool>
        SaveCFG(DEBUG_TYPE "-save-cfg",
                cl::desc("Save control flow graph (GraphViz)"),
                cl::init(true), cl::Hidden);

// TODO: Give credit to IfConversion pass?
//         (only if idea of branch-patterns is used)
// TODO: Refactor: Decompose in several classes
//        (sensitivity analysis, shape matchers,...)

namespace {

/// Defends against DMA attacks
    class MSP430DMADefenderPass : public MachineFunctionPass {
    public:

        /// A vector of defs (instruction ids) for a given register unit
        //TODO: using RegUnitDefs = SmallVector<size_t, 1>;
        using RegUnitDefs = std::vector<size_t>;
        /// All defs for a given MBB, indexed by register unit id
        using MBBDefsInfo = std::vector<RegUnitDefs>;

        /// A vector of dependencies to instructions, used for storing reaching
        //   definitions.
        using MIDepsInfo = SmallVector<MachineInstr *, 1>;
        /// All instruction dependencies for a given MBB, indexed by instruction id
        using MBBDepsInfo = std::vector<MIDepsInfo>;

        enum BranchClass {
            BCNotClassified, // MBB is unclassified
            BCFork,          // MBB is the entry of a fork shaped sub-CFG
            BCDiamond,       // MBB is the entry of a diamond shaped sub-CFG
            BCTriangle,      // MBB is the entry of a triangle shaped sub-CFG.
        };

        struct MBBInfo {
            bool IsDone                     : 1;
            bool IsAligned                  : 1;
            bool IsAnalyzable               : 1;
            bool IsBranch                   : 1; // Conditional or unconditional branch
            bool IsConditionalBranch        : 1;
            bool IsPartOfSensitiveRegion    : 1;
            bool IsLoopHeader               : 1;
            bool IsLoopLatch                : 1;
            bool IsCanonicalLoopBlock       : 1;
            bool HasSecretDependentBranch   : 1;
            bool IsEntry                    : 1;
            bool IsReturn                   : 1;
            bool IsMultiWayBranch           : 1;
            int TripCount = -1; /* Only relevant when IsLoopHeader is true */
            /* LTODO: Add LoopInfo struct ? */
            size_t TerminatorCount = 0;
            MachineBasicBlock *BB = nullptr;
            MachineBasicBlock *Orig = nullptr; // Orignal contents of BB
            // Next is set when the next block can be statically determined
            MachineBasicBlock *Next = nullptr;
            MachineBasicBlock *TrueBB = nullptr;
            MachineBasicBlock *FalseBB = nullptr;
            MachineBasicBlock *FallThroughBB = nullptr;
            SmallVector<MachineOperand, 4> BrCond;

            // !TODO: Figure out if the implemenation cannot use the
            //         MachineRegisterInfo (MRI) class for this...
            //        (there seems to be some redundancy with what I implemented
            //         and with what this class provides...)
            // => And what about the liveness information, why can't we reuse that?
            MBBDefsInfo Defs;
            MBBDepsInfo Deps;

#if 0
            // TODO: Transform to OO design with polymorhic method align()
    //        and match() class method
    // Branch class info
    BranchClass BClass = BCNotClassified;
    union {
      struct {
        MachineBasicBlock *LeftBB;
        MachineBasicBlock *RightBB;
      } Fork;
      struct {
      } Diamond;
      struct {
        MachineBasicBlock *DivBB;  // Block that diverges from the 'short path'
        MachineBasicBlock *JoinBB; // Block where the branches rejoin
      } Triangle;
    } BCInfo;
#endif

            MBBInfo() : IsDone(false), IsAligned(false), IsAnalyzable(false),
                        IsBranch(false), IsConditionalBranch(false),
                        IsPartOfSensitiveRegion(false), IsLoopHeader(false), IsLoopLatch(false),
                        IsCanonicalLoopBlock(false),
                        HasSecretDependentBranch(false),
                        IsEntry(false), IsReturn(false) {}
        };

        // Set to true when the sensitivity analysis detected at least one
        // secret dependent branch
        bool HasSecretDependentBranch = false;

        // Return type of ComputeSuccessors
        struct Successors {
            std::vector<MachineBasicBlock *> Succs;
            MachineLoop *Loop; // ! TODO: Beware of dangling pointers
        };

        MSP430DMADefenderPass() : MachineFunctionPass(ID) {}

        StringRef getPassName() const override { return "MSP430 DMA Defender"; }
        bool runOnMachineFunction(MachineFunction &MF) override;
        void getAnalysisUsage(AnalysisUsage &AU) const override;
        void releaseMemory() override;

        /// Pass identification, replacement for typeid.
        static char ID;

    private:

        /// Maps instructions to their instruction Ids, relative to the beginning of
        /// their basic blocks.
        DenseMap<MachineInstr *, size_t> InstIds;
        /// The set of sensitive instructions
        SmallPtrSet<const MachineInstr *, 10> SensitivityInfo;
        /// The set of sensitive values
        SmallPtrSet<const Value *, 10> SensitivityInfo2;

        MachineFunction *MF;
        // The sensitivity analysis procedure determines whether canonicalization is
        // required (i.e. when a sensitive region contains a return node).
        MachineBasicBlock *CanonicalExit = nullptr;
        MachineRegisterInfo *MRI;
        MachineLoopInfo *MLI;
        //const TargetLoweringBase *TLI;
        const TargetInstrInfo *TII;
        const TargetRegisterInfo *TRI;
        MachineDominatorTree *MDT;
        MachinePostDominatorTree *MPDT;

