SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
        /// TODO: OPTIMIZE: Analysis results indexed by basic block number
        //         SmallVector<MBBInfo, 4> BBAnalysis;
        std::map<MachineBasicBlock *, MBBInfo> BBAnalysis;
        MBBInfo *EntryBBI = nullptr;

        MBBInfo *GetInfo(MachineBasicBlock &MMB);
        std::vector<size_t> GetDefs(MBBInfo *BBI, size_t RU,
                                    std::function<bool(size_t)> P);
        std::vector<size_t> GetDefsBefore(MBBInfo *BBI, size_t RU, size_t IID);
        std::vector<size_t> GetDefsAfter(MBBInfo *BBI, size_t RU, size_t IID);
        MachineBasicBlock *CreateMachineBasicBlock(
                StringRef debug, bool addToMF=false);
        MachineBasicBlock *CloneMBB(MachineBasicBlock *MBB, bool addToMF);

        void Taint(MachineInstr *MI);
        bool IsPartOfSensitiveRegion(const MachineInstr *MI);

        MachineBasicBlock *GetExitOfSensitiveBranch(MachineBasicBlock *Entry);

        void RemoveTerminationCode(MachineBasicBlock &MBB);
        void ReplaceSuccessor(MachineBasicBlock *MBB, MachineBasicBlock *Old,
                              MachineBasicBlock *New);

        std::vector<MachineBasicBlock *> GetFingerprint(MachineLoop *L);
        void BuildFingerprint(MachineLoop *L, std::vector<MachineBasicBlock *> &FP);

        // Exit is the "join block" or the "point of convergence" of the originating
        //  sensitive region.
        Successors
        ComputeSuccessors(std::vector<MachineBasicBlock *> L, MachineBasicBlock *Exit);

        Register FindUnusedRegisters(std::vector<MachineBasicBlock *> BBs);
        void AlignNonTerminatingInstructions(std::vector<MachineBasicBlock *> L, Register UnusedReg);
        void CanonicalizeTerminatingInstructions(MachineBasicBlock *MBB);
        void AlignTwoWayBranch(MachineBasicBlock &MBB);

        void CheckAccessedMemoryRegions(std::vector<MachineBasicBlock *> BBs, const TargetInstrInfo *TII, Register UnusedReg);

        // Returns information about sensitivity of machine instructions and basic
        //  block info.
        bool IsSecretDependent(MachineInstr *MI);
        bool IsSecretDependent(MBBInfo *BBI);
        bool IsTwoWayBranch(MBBInfo *BBI);

        void PrepareAnalysis();
        void FinishAnalysis();
        void CanonicalizeCFG();

        bool addDependency(MachineInstr *MI, MachineBasicBlock *MBB,
                           std::vector<size_t> &Defs);

        // RU is a register unit
        void ComputeDependencies(MachineInstr *MI, size_t RU, MachineBasicBlock *MBB,
                                 SmallPtrSetImpl<MachineBasicBlock *> &Visited);

        void RegisterDefs(MBBInfo &BBI);

        void CompensateInstr(const MachineInstr &MI, MachineBasicBlock &MBB,
                             MachineBasicBlock::iterator MBBI, Register UnusedReg);
        void CompensateCall(const MachineInstr &Call, MachineBasicBlock &MBB,
                            MachineBasicBlock::iterator MBBI);
        void SecureCall(MachineInstr &Call);

#if 0
        MachineBasicBlock::iterator GetPosBeforeBranchingCode(MachineBasicBlock *MBB)
  const;

  bool MatchFork(MBBInfo &EBBI);
  bool MatchDiamond(MBBInfo &EBBI);
  bool MatchTriangle(MBBInfo &EBBI, bool DivOnFalse);

  MachineBasicBlock::iterator AlignBlock(MachineBasicBlock &Source,
                                         MachineBasicBlock::iterator SI,
                                         MachineBasicBlock &Target,
                                         MachineBasicBlock::iterator TI);

  bool IsEnryOfPattern(MBBInfo &BBI, BranchClass BClass);

  void AlignTriangle(MBBInfo &EBBI);
  void AlignDiamond(MBBInfo &EBBI);
  void AlignFork(MBBInfo &EBBI);

  void ClassifyBranches();
#endif

        // TODO: Move analyzeCompare to TargetInstrInfo?
        bool analyzeCompare(const MachineInstr &MI, unsigned &SrcReg,
                            unsigned &SrcReg2, int &CmpMask, int &CmpValue) const;
        int GetLoopTripCount(MachineLoop *L);

        void RedoAnalysisPasses();

        void AnalyzeControlFlow(MBBInfo &BBI);
        void AnalyzeControlFlow(MachineBasicBlock &MBB);
        void AnalyzeControlFlow();

        void ReAnalyzeControlFlow(MachineBasicBlock &MBB);

        void VerifyControlFlowAnalysis();

        void ComputeReachingDefs();
        void PerformSensitivityAnalysis();

        void DetectOuterSensitiveBranches();
        void AnalyzeLoops();

        void CanonicalizeSensitiveLoop(MachineLoop *Loop);
        void AlignContainedRegions(MachineLoop *L);

        void SecureCalls();
        void AlignSensitiveBranches();

        void AlignSensitiveBranch(MBBInfo &BBI);
        std::vector<MachineBasicBlock *>
        AlignSensitiveLoop(MachineLoop *Loop, std::vector<MachineBasicBlock *> MBBs);
        std::vector<MachineBasicBlock *>
        AlignFingerprint(std::vector<MachineBasicBlock *> FP, std::vector<MachineBasicBlock *> MBBs);

        void WriteCFG(std::string label);
        void DumpCFG();
        void DumpDebugInfo();
    };

} // end anonymous namespace

char MSP430DMADefenderPass::ID = 0;

void MSP430DMADefenderPass::getAnalysisUsage(AnalysisUsage &AU) const {
    //AU.setPreservesCFG(); // TODO
    AU.addRequired<MachineLoopInfo>();
    AU.addRequired<MachineDominatorTree>(); // Because required by MLI (and must be
    //   maintained by this pass)
    AU.addRequired<MachinePostDominatorTree>();
    MachineFunctionPass::getAnalysisUsage(AU);
}

// TODO: Is there a better way to pass information about confidentiality from
//        frontend via middle-end to backend ?
static bool IsSecret(const Argument &Arg) {
    return Arg.getParent()->getAttributes().hasAttribute(Arg.getArgNo() + 1,
                                                         "secret");
}

static std::string GetName(MachineBasicBlock *MBB) {
    return MBB ? ("bb" + Twine(MBB->getNumber())).str() : "null";
}

static MachineBasicBlock *GetEntryMBB(MachineFunction *MF) {
    assert(MF->size() > 0);
    MachineBasicBlock *MBB = MF->getBlockNumbered(0);
    assert(MBB != nullptr);
    assert(MBB->pred_size() == 0);
    return MBB;
}

// TODO: Move this logic to MSP430InstrInfo
static bool isCGConstant(const int immediateValue) {
    switch (immediateValue) {
        case -1:
        case 0:
        case 1:
        case 2:
        case 4:
        case 8:
            return true;
        default:
            return false;
    }
}

// TODO: Move this logic (when to use one of the constant generator regs)
//    to MSP430InstrInfo
static const MCInstrDesc &
getCompareInstr(const TargetInstrInfo *TII, const int immediateValue) {
    return isCGConstant(immediateValue)
           ? TII->get(MSP430::CMP16rc)
           : TII->get(MSP430::CMP16ri);
}

/// Analyze the terminators of a given MBB (uses TII->analyzeBranch):
///   - Detect branches
///   - Detect branch patterns
///   - Detect loops and upper iteration bound
///   - Look at the instructions at the end of the MBB (terminators)
///   - Be conservative: reject unsupported branch patterns if the branching
///      condition is based on secret information
/// Verify that the MBB conforms to the well-formedness criterion
///   (or do this in VerifyControlFlowAnalysis ?)
//
// TODO: Move this code to a seperate analysis pass
void MSP430DMADefenderPass::AnalyzeControlFlow(MBBInfo &BBI) {
    assert(! BBI.IsDone);

    auto MBB = BBI.BB;

    // General information
    BBI.FallThroughBB  = MBB->getFallThrough();

    BBI.TerminatorCount = std::distance(MBB->getFirstTerminator(), MBB->end());
    if (BBI.TerminatorCount <= 2) {

        BBI.IsEntry = MBB->pred_empty();
        if (BBI.IsEntry) {
            EntryBBI = &BBI;
        }

        if (BBI.TerminatorCount == 0) {
            // TODO: Not sure if the following assertions are all correct...
            assert(BBI.FallThroughBB != nullptr);
            assert(MBB->succ_size() == 1);
            assert(BBI.FallThroughBB == *MBB->succ_begin());
        }

