SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    LLVM_DEBUG(dbgs() << "TRIP COUNT=" << TripCount);
    LLVM_DEBUG(dbgs() << " CC="    << CC);
    LLVM_DEBUG(dbgs() << " BEGIN=" << IVInV);
    LLVM_DEBUG(dbgs() << " STEP="  << IVUpV);
    LLVM_DEBUG(dbgs() << " END="   << CmpValue);
    LLVM_DEBUG(dbgs() << "\n");

    return TripCount;
}

void MSP430DMADefenderPass::AnalyzeControlFlow() {
    for (MachineBasicBlock &MBB : *MF) {
        AnalyzeControlFlow(MBB);
    }
}

void MSP430DMADefenderPass::ReAnalyzeControlFlow(MachineBasicBlock &MBB) {
    auto BBI = GetInfo(MBB);

    // TODO: Not every field below should be reset
    //         (maybe its better to move this code to the MBBInfo struct)
    BBI->IsDone = false;
    // IsAligned status cannot be reset
    //BBI->IsAligned = false;
    BBI->IsAnalyzable = false;
    BBI->IsBranch = false;
    BBI->IsConditionalBranch = false;
    // HasSecretDependentBranch is set in PerformSensitivityAnalysis, not in
    //  AnalyzeControlFlow
    //BBI->HasSecretDependentBranch = false;
    // IsPartOfSensitiveRegion is set during outer region analysis
    /// BBI->IsPartOfSensitiveRegion
    BBI->IsEntry = false;
    BBI->IsReturn = false;
    BBI->BB = nullptr;
    // There is no need to reset the original contents
    //BBI->Orig = nullptr;

    // Dont' touch loop analysis (loop analysis should not change)
    // BBI->IsLoopHeader = false;
    // BBI->IsLoopLatch = false;
    // BBI->TripCount = 0;
    BBI->Next = nullptr;
    BBI->TrueBB = nullptr;
    BBI->FalseBB = nullptr;
    BBI->FallThroughBB = nullptr;
    BBI->TerminatorCount = 0;
    BBI->BrCond.clear();
    BBI->Defs.clear();
    BBI->Deps.clear();
#if 0
    std::memset(&BBI->BCInfo, 0, sizeof(BBI->BCInfo));
#endif

    AnalyzeControlFlow(MBB);
}

// Verify the analysis results, assert assumptions
// Also check well-formedness criterion of termination code
//   (or does this belong in the AnalyzeControlFlow method ?)
void MSP430DMADefenderPass::VerifyControlFlowAnalysis() {
    // Every block should have been analyzed
    for (MachineBasicBlock &MBB : *MF) {
#if 0  // Re-enable when BBAnalysis is a vector
        size_t N = MBB.getNumber();
    assert(N < BBAnalysis.size() && "Unexpected basic block number");
    assert(BBAnalysis[N].IsDone);
#else
        assert(BBAnalysis.find(&MBB) != BBAnalysis.end());
        assert(BBAnalysis[&MBB].IsDone);
#endif
        auto BBI = GetInfo(MBB);

        // Verify well-formedness criterion
        if (BBI->IsAnalyzable) {
            //
            // o Maximum two termination instructions are allowed
            assert(BBI->TerminatorCount <= 2);

            // o For unconditional branches, only the following addressing modes
            //       will be supported. Reject all others (set IsAnalyzable to false).
            //   - immediate (3 cycles)
            //   - symbolic (3 cycles)
            //   - absolute (3 cycles)
            // TODO
        }
    }

    // There should be exaclty one entry point
    assert(EntryBBI != nullptr);
    assert(EntryBBI->BB == GetEntryMBB(MF) && "Unexpected entry block");
    assert(std::count_if(BBAnalysis.begin(), BBAnalysis.end(),
                         [](std::pair<const MachineBasicBlock *, MBBInfo> x) {
                             return x.second.IsEntry;
                         }) == 1);
}

// Returns all the definitions of register unit RU in BII.BB for which
//   predicate P evaluates to true
std::vector<size_t>
MSP430DMADefenderPass::GetDefs(MBBInfo *BBI, size_t RU,
                                   std::function<bool(size_t)> P) {
    std::vector<size_t> R;
    R.resize(BBI->Defs[RU].size());
    auto I =
            std::copy_if(BBI->Defs[RU].begin(), BBI->Defs[RU].end(), R.begin(), P);
    R.resize(std::distance(R.begin(), I));
    return R;
}

// Returns all the definitions of register unit RU in BII.BB that come before
// the given instruction identifier.
std::vector<size_t>
MSP430DMADefenderPass::GetDefsBefore(MBBInfo *BBI, size_t RU, size_t IID) {
    return GetDefs(BBI, RU, [IID](size_t DIID) { return DIID < IID; });
}

// Returns all the definitions of register unit RU in BII.BB that come after
// the given instruction identifier.
std::vector<size_t>
MSP430DMADefenderPass::GetDefsAfter(MBBInfo *BBI, size_t RU, size_t IID) {
    return GetDefs(BBI, RU, [IID](size_t DIID) { return DIID > IID; });
}

// TODO: It is the responsibility of callers to CreateMachineBasicBlock to call
//  AnalyzeControlFlow on the created block when appropriate. This should be
//  made more robust and future proof as callers are probably going to forget
//  this.
MachineBasicBlock * MSP430DMADefenderPass::CreateMachineBasicBlock(
        StringRef debug, bool addToMF) {
    MachineBasicBlock *MBB = MF->CreateMachineBasicBlock(nullptr);
    if (addToMF) {
        MF->push_back(MBB);
        LLVM_DEBUG(dbgs() << "New MBB: " << GetName(MBB) << " (" << debug << ")\n");
    }
    return MBB;
}

// Clones a MBB (contents only)
// TODO: It is the responsibility of callers to CloneBlock to call
//  AnalyzeControlFlow on the created block when appropriate. This should be
//  made more robust and future proof as callers are probably going to forget
//  this.
MachineBasicBlock *MSP430DMADefenderPass::CloneMBB(
        MachineBasicBlock *MBB, bool addToMF) {
    //LLVM_DEBUG(dbgs() << "Cloning " << GetName(MBB) << "\n");
    MachineBasicBlock *Clone = CreateMachineBasicBlock("clone", addToMF);
    for (auto &MI : *MBB) {
        // TODO: Use MF->CloneMachineInstrBundle() ?
        Clone->push_back(MF->CloneMachineInstr(&MI));
        // TODO: What is the difference with MI.Clone() ?
        //
        //!!TODO How to deal with instruction that refer to other MBBs
        //        and that are no jump-instructions (e.g. just take the adresss
        //        of a MBB, ...)
        //        In the clone they should probably refer to another MBB
        //        This should be handled case by case, just as changing the
        //        termination instructions of the clone, and as adapting the
        //        CFG ...
    }

    // Keep track of the original contents
    // TODO: This should be refactored (addToMF is a bad name to start with)
    //        addToMF is only false, when the original clone is being made
    //        (original clone has a block number of -1)
    //        in all other cases, the MBB is the original clone
    if (addToMF) {
        assert(MBB->getNumber() == -1);
        GetInfo(*Clone)->Orig = MBB;
    }

    return Clone;
}

/// Removes the branching code at the end of the specific MBB.
/// Non-branching termination code is ignored.
/// TODO: This function is redundant to TII->removeBranch(MBB)
void MSP430DMADefenderPass::RemoveTerminationCode(MachineBasicBlock &MBB) {
    MBBInfo *BBI = GetInfo(MBB);
    assert(BBI->IsAnalyzable);

