SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    if (BBI->IsBranch) {
        assert(BBI->TerminatorCount > 0);
        TII->removeBranch(MBB);
    }
    else if (BBI->IsReturn) {
        MachineBasicBlock::iterator I = MBB.end();
        I--;
        assert(I->getOpcode() == MSP430::RET);
        I->eraseFromParent();
    }
    else {
        // This must be a pure fallthrough block
        //  So, no branch to remove
        assert (BBI->TerminatorCount == 0);
        assert(BBI->FallThroughBB != nullptr);
    }
}

// Updates CFG, BB analysis and the MBBs' termination code accordingly
//
// Re-analyzes the CF for MBB
void MSP430DMADefenderPass::ReplaceSuccessor(
        MachineBasicBlock *MBB, MachineBasicBlock *Old, MachineBasicBlock *New) {

    assert(MBB->isSuccessor(Old));

    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    // 1. Update CFG (A correct CFG is a precondition for TII->insertBranch)
    MBB->replaceSuccessor(Old, New);

    // 2. Update termination code
    RemoveTerminationCode(*MBB);
    auto BBI = GetInfo(*MBB);
    if (BBI->IsBranch) {
        if (BBI->TrueBB == Old) BBI->TrueBB = New;
        if (BBI->FalseBB == Old) BBI->FalseBB = New;
        if (BBI->IsConditionalBranch) {
            TII->insertBranch(*MBB, BBI->TrueBB, BBI->FalseBB, BBI->BrCond, DL);
        }
        else {
            assert(BBI->FallThroughBB == nullptr);
            TII->insertBranch(*MBB, BBI->TrueBB, nullptr, {}, DL);
        }
    }
    else {
        assert(! BBI->IsReturn); // A block with a successor cannot return
        assert(BBI->FallThroughBB != nullptr);
        assert(BBI->FallThroughBB == Old);
        BBI->FallThroughBB = nullptr;
        TII->insertBranch(*MBB, New, nullptr, {}, DL);
    }

    // Update control-flow analysis
    ReAnalyzeControlFlow(*MBB);
}

static void Build_1_0_0_1(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // MOV #0, R3 gave rise to a NOP inserted, which is allright, but might
    // lead to confusion on how the program is patched (NOPs almost never suffice)

    // MOV #8, R3
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16rc), MSP430::CG).addImm(8);
}
static void Build_2_00_00_11(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // MOV #420, R3
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16ri), MSP430::CG).addImm(420);
}

static void Build_2_00_10_01(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // MOV @RUnused, R3
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16rn), MSP430::CG).addReg(UnusedReg);
}

static void Build_3_000_010_101(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // MOV 2(RUnused), R3
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16rm), MSP430::CG).addReg(UnusedReg).addImm(2);
}

static void Build_3_000_101_001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // SWPB @RUnused
    BuildMI(MBB, I, DL, TII->get(MSP430::SWPB16n)).addReg(UnusedReg);
}

static void Build_3_000_001_001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    //! TODO: what to do about a PUSH?
    BuildMI(MBB, I, DL, TII->get(MSP430::CMP16ri), MSP430::CG).addImm(432);
}

static void Build_3_000_100_000(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL; // RET
    //! TODO: what to do about a RET?
    BuildMI(MBB, I, DL, TII->get(MSP430::CMP16ri), MSP430::CG).addImm(433);
}

static void Build_4_0000_0101_1001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // indirect benchmark program
    // RRA 2(RUnused)
    BuildMI(MBB, I, DL, TII->get(MSP430::RRA16m), UnusedReg).addImm(2);
}


static void Build_4_0000_0001_1001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    //! TODO: what to do about a PUSH?
    // MOV #0, 2(RUnused)
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16mc), UnusedReg).addImm(2).addImm(0);
}
static void Build_5_00000_00101_11001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // ADD #42, 2(RUnused)
    BuildMI(MBB, I, DL, TII->get(MSP430::ADD16mi), UnusedReg).addImm(2).addImm(42);
}

static void Build_5_00000_10101_10001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // ADD @RUnused, 2(RUnused)
    BuildMI(MBB, I, DL, TII->get(MSP430::ADD16mn), UnusedReg).addImm(2).addReg(UnusedReg);
}

static void Build_5_00000_00001_11001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // MOV #42, 2(RUnused)
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16mi), UnusedReg).addImm(2).addImm(42);
}

static void Build_5_00000_10001_10001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // MOV @RUnused, 2(RUnused)
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16mn), UnusedReg).addImm(2).addReg(UnusedReg);
}

static void Build_5_00000_10000_00000(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    //! TODO: what to do about a RETI
    BuildMI(MBB, I, DL, TII->get(MSP430::CMP16ri), MSP430::CG).addImm(454);
}

static void Build_6_000000_010101_110001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    // ADD 2(RUnused), 2(R3)
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16mm), UnusedReg)
            .addImm(2)
            .addReg(UnusedReg)
            .addImm(2);
}

