SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
static void Build_6_000000_010001_110001(MachineBasicBlock &MBB, MachineBasicBlock::iterator I, const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    //! TODO: this is just a dummy, replace it with a better error (used for testing)
    BuildMI(MBB, I, DL, TII->get(MSP430::CMP16ri), MSP430::CG).addImm(461);
}

void MSP430DMADefenderPass::CheckAccessedMemoryRegions(std::vector<MachineBasicBlock *> BBs,
                                                       const TargetInstrInfo *TII, Register UnusedReg) {
    DebugLoc DL;
    long addrValue;
    for (MachineBasicBlock *BB : BBs) {
        bool periphOrProgrMemoryAccessed = false;
        for (auto instr = BB->instr_begin(); instr != BB->instr_end(); ++instr){
            for (auto op : instr->memoperands()) {
                if (op->getValue()->getType()->getTypeID() ==  Type::PointerTyID && !(op->getValue()->getValueID() == Value::GlobalVariableVal)){
                    addrValue = op->getPointerInfo().Offset;
                    periphOrProgrMemoryAccessed = true;
                }
                if (op->getValue()->getValueID() == Value::ConstantExprVal) {
                    periphOrProgrMemoryAccessed = true;
                }
            }
        }
        if (periphOrProgrMemoryAccessed) {
            BuildMI(*BB, BB->begin(), DL, TII->get(MSP430::MOV16rc), MSP430::CG).addImm(addrValue);
            //BuildMI(*BB, BB->begin(), DL, TII->get(MSP430::RET));
        }

    }
}



// !TODO: Should it be "MOV16rc" or "MOV16ri" ??? (because of immediate
//        value of one) (look also at other places for this choice)
//      REMARK: When *rc variant is used, "nop" is generated instead of
//      instruction  in the case of the dummy instructions
//          (see buildNop1, buildNop2,...). and consequently, test-nemdef
//          unit test suite fails.
static void BuildNOP1(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    // MOV  #0, R3       ; 1 cycle , 1 word
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16rc), MSP430::CG).addImm(0);
}

static void BuildNOP2(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

#if 0
    // TODO: This might be problematic, as entering a JMP in the middle
  //        of a MBB breaks the well-formedness of the MBB
  // JMP  $+2          ; 2 cycles, 1 word
  BuildMI(MBB, I, DL, TII->get(MSP430::JMP)).addImm(0);
#else
    // TODO: According to the the MSP430 manual, this is an illegal
    //        instruction, but OpenMSP430 seems to accept this.
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16ri), MSP430::CG).addImm(42);
#endif
}

static void BuildNOP3(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    // MOV  2(PC), R3    ; 3 cycles, 2 words
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16rm), MSP430::CG)
            .addReg(MSP430::PC)
            .addImm(2);
}

static void BuildNOP4(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    // BIC  #0, 0(R4)    ; 4 cycles, 2 words
    BuildMI(MBB, I, DL, TII->get(MSP430::BIC16mi), MSP430::R4)
            .addImm(0)
            .addImm(0);
}

static void BuildNOP5(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    // MOV  @R4, 0(R4)   ; 5 cycles, 2 words
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16mn), MSP430::R4)
            .addImm(0)
            .addReg(MSP430::R4);
}

static void BuildNOP6(MachineBasicBlock &MBB, MachineBasicBlock::iterator I,
                      const TargetInstrInfo *TII) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    // MOV  0(R4), 0(R4) ; 6 cycles, 3 words
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16mm), MSP430::R4)
            .addImm(0)
            .addReg(MSP430::R4)
            .addImm(0);
}

// TODO: MSP430 specific
// According to the MSP430 manual, a branch instruction always takes two cycles
// two execute, independent on whether a branch is taken or not
static void BuildNOPBranch(MachineBasicBlock &MBB,
                           MachineBasicBlock::iterator I,
                           const TargetInstrInfo *TII) {
    BuildNOP2(MBB, I, TII);
}

// Builds the fingerprint of the region. The fingerprint is a slice of the
//  region, a list of basic blocks that represents a unique path of through the
//  aligned region. It kind of represents "all possible paths" of the aligned
//  loop.
//
// PRE: The region (from header to latch in the case of loop regions) must be
//       aligned for the fingerprint to be correct. This means alignment of
//         - terminating instructions
//         - non-terminating instructions
//         - two-way branches
//
// Any control-flow path from loop-header to loop-latch should do, because
//  the loop region is already aligned (precondition) which means that all
//  possible paths from header to latch are observably equivalent.
//  Therefore, do a DFS traversal through the sensitive region.
void MSP430DMADefenderPass::BuildFingerprint(
        MachineLoop *L, std::vector<MachineBasicBlock *> &Result) {

    auto Header = L->getHeader();
    assert(Header != nullptr && "Well-formed loop expected");
    auto Latch = L->getLoopLatch();
    assert(Latch != nullptr && "Well-formed loop expected");

    // Build the fingerprint by performing a dept-first traversal.
    //  - Because of the well-formedness criterion, the last block of a DFS (in
    //    any path) should be the loop latch.
    //  - Assert that the following while-loop terminates, which is the case when
    //    the latch block post-dominates the header.
    assert(MPDT->dominates(Latch, Header) && "Well-formed loop expected");
    std::set<MachineBasicBlock *> Visited;
    MachineBasicBlock *PrevBB = nullptr;
    MachineBasicBlock *CurBB = Header;

    // REMARK: This must also work for paths that contain "artifical" loops
    while (CurBB != Latch) {
        assert(Visited.find(CurBB) == Visited.end() && "Well-formed loop expected");
        Visited.insert(CurBB);

        auto L2 = MLI->getLoopFor(CurBB);
        assert(L2 != nullptr);

        if (L2 == L) {
            auto BBI = GetInfo(*CurBB);

