SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
            Result.push_back(CurBB);

            // It is a precondition of this function that all sensitive regions in the
            // given loop are aligned. This means that the number of statements
            // should be the same for any path that is taken in the loop region. Still,
            // caution has to be taken for two-way branches because the second JMP is
            // only executed in the false branch.
            PrevBB = CurBB;
            if (BBI->IsConditionalBranch) {
                assert(CurBB->succ_size() == 2 && "Well-formed MBB expected");

                // Follow the false path to avoid compensating for the
                //   1) the "JMP" instruction from the (JCC, JMP) pair _and_
                //   2) the JMP-compensated instruction in the true path
                assert(BBI->BB->isSuccessor(BBI->TrueBB));
                assert(BBI->BB->isSuccessor(BBI->FalseBB));

                CurBB = BBI->FalseBB;
            } else {
                assert(CurBB->succ_size() == 1 && "Well-formed MBB expected");

                CurBB = *CurBB->succ_begin();
            }
        } else {
            // Deal with this nested loop
            assert(L2->getLoopPreheader() == PrevBB && "Well-formed loop expected");
            BuildFingerprint(L2, Result);

            // Continue with the loop-exit block
            PrevBB = CurBB;
            CurBB = L2->getExitBlock();
            assert(CurBB != nullptr && "Well-formed loop expected");
        }
    }

    Result.push_back(Latch);
}

// Fingerprint as a vector of MBBs
std::vector<MachineBasicBlock *>
MSP430DMADefenderPass::GetFingerprint(MachineLoop *L) {
    std::vector<MachineBasicBlock *> Result;
    BuildFingerprint(L, Result);
    return Result;
}

bool MSP430DMADefenderPass::IsTwoWayBranch(MBBInfo *BBI) {
    bool result = false;

    if (BBI->HasSecretDependentBranch) {
        if (BBI->IsConditionalBranch && (BBI->FallThroughBB == nullptr)) {
            assert(BBI->TerminatorCount == 2);
            result =  true;
        }
    }

    return result;
}

void MSP430DMADefenderPass::AlignTwoWayBranch(MachineBasicBlock &MBB) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    auto BBI = GetInfo(MBB);

    assert(IsTwoWayBranch(BBI));

    auto T = MBB.getFirstTerminator();
    assert(T++->isConditionalBranch());
    assert(T++->isUnconditionalBranch());
    assert(T == MBB.end());

    LLVM_DEBUG(dbgs() << GetName(&MBB) << ": Align two-way branch\n");

    if ( std::all_of(BBI->TrueBB->pred_begin(), BBI->TrueBB->pred_end(),
                     [this](MachineBasicBlock *MBB) {return this->IsTwoWayBranch(GetInfo(*MBB)); })) {
        // Compensate for the unconditional jump when the conditional jump has
        // been taken (in the true path).
        BuildNOPBranch(*BBI->TrueBB, BBI->TrueBB->begin(), TII);
    }
    else {
        // Add a "jump block" between MBB and TrueBB to contain a single
        // unconditional jump statement)
        auto JBB = CreateMachineBasicBlock("align", true);
        BuildMI(*JBB, JBB->begin(), DL, TII->get(MSP430::JMP)).addMBB(BBI->TrueBB);
        JBB->addSuccessor(BBI->TrueBB);

        // Update MBB accordingly
        ReplaceSuccessor(&MBB, BBI->TrueBB, JBB);
        RemoveTerminationCode(MBB);
        TII->insertBranch(MBB, JBB, BBI->FalseBB, BBI->BrCond, DL);

        // Update control flow analysis
        ReAnalyzeControlFlow(MBB);
        AnalyzeControlFlow(*JBB);

        auto JBBI = GetInfo(*JBB);
        JBBI->Orig = CloneMBB(JBB, false); // TODO: Refactor the bookkeeping of
        //        the original block contents
        assert(JBB->succ_size() == 1);
        assert(JBB->pred_size() == 1);
    }
}

// Returns
//   1) when one of the direct successors of MBBs represents the header of a
//        loop,
//      - Successors.Loop points to the hedear of the detected loop
//      - Successors.Succs represents the union of all successors of all MBBs
//         modulo the detected Loop header
//     The CFG will not be mutated.
//
//   2) otherwise
//      - Successors.Loop will be nullptr
//      - Successors.Succs represents the union of the direct successors of
//         every MMB in MBBs
//      Possibly mutates the MF (and its corresonding CFG) in order for the
//      preconditions of AlignNonTerminatingInstructions() to be valid.
//
// PRE: All MBB in MBBs are part of a sensitive region
// POST: R.Succs does not contain any duplicate blocks
//
// Param Exit is the "join block" or the "point of convergence" of the
// originating sensitive region.
//
// TODO: When a new basic block is added, a number of analyses, such
//   as CF analysis, have to be (re)done and some data structures,
//   such as the CFG, need to be maintained. This occurs at multiple
//   locations in this pass and should be factored out in a common
//   method.
MSP430DMADefenderPass::Successors
MSP430DMADefenderPass::ComputeSuccessors(
        std::vector<MachineBasicBlock *> MBBs, MachineBasicBlock *Exit) {
    LLVM_DEBUG(dbgs() << "> Compute successors of ");
    LLVM_DEBUG(for (auto MBB: MBBs) dbgs() << GetName(MBB) << ", ");
    LLVM_DEBUG(dbgs() << "\n");

    std::set<MachineBasicBlock *> Set;
    Successors R;
    R.Loop = nullptr;

    auto IsDone = [Exit](MachineBasicBlock * MBB) {
        return MBB->succ_size() == 1 && (*MBB->succ_begin() == Exit);
        // TODO: Check that the transformation in this pass does not invalidate
        //        the (post)dominator tree analysis
    };

    if ( ! std::all_of(MBBs.begin(), MBBs.end(), IsDone) ) {

        // Loop detector
        //   Deal with possible loops first
        //   => Check if one of the successors is the start of a new loop
        for (auto MBB : MBBs) {
            auto L1 = MLI->getLoopFor(MBB);
            for (auto S : MBB->successors()) {
                auto L2 = MLI->getLoopFor(S);
                if ((L2 != nullptr) && (L1 != L2)) {
                    R.Loop = L2; // Loop found

                    LLVM_DEBUG(dbgs() << "Loop found :"
                                      << " MBB=" << GetName(MBB)
                                      << " S=" << GetName(S)
                                      << " header=" << GetName(L2->getHeader())
                                      << " latch=" << GetName(L2->getLoopLatch())
                                      << " exit=" << GetName(L2->getExitBlock())
                                      << "\n");

                    if (! MLI->isLoopHeader(S)) {
                        MF->viewCFG();
                    }
                    assert(MLI->isLoopHeader(S));
                    // TODO: When a loop has more than one predecessor,
                    //    getLoopPredecessor() returns nullptr. Fix this by duplicating
                    //    the loop for every predecessor (can be optimized if every
                    //    predecessor initializes the induction variable with the same
                    //    value)
                    // The LLVM MSP430 backend, for example, generates this kind of loop
                    // when multiplying by two (see compound-conditional-expr.c)
                    auto P = L2->getLoopPredecessor();
                    assert(P != nullptr); // See comment above
                    assert(P == MBB);
                    assert(S->pred_size() == 2); // MBB and Latch
                    assert(L2->getLoopPreheader() != nullptr);
                    auto LL = L2->getLoopLatch();
                    assert(L2->getLoopLatch() && "Loops with multiple latch blocks are not supported");
                    auto E = L2->getExitBlock();
                    assert(E && "Loops with multiple exit blocks are not supported");

                    auto BBI = GetInfo(*LL);
                    assert(BBI->IsConditionalBranch);
                    assert(BBI->BrCond.size() == 1);
                    assert(BBI->BB->succ_size() == 2); // See well-formedness criterion
                    assert(BBI->TrueBB != nullptr);
                    assert(BBI->FalseBB != nullptr);
                    assert(L2->contains(BBI->TrueBB) || L2->contains(BBI->FalseBB));

