SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
#if 0
                    auto IPDom = (*MPDT)[S]->getIDom(); // Immediate post-dominator
          assert(IPDom->getBlock() != nullptr && "Loop is not well-formed");
          assert(IPDom->getBlock() == E && "Loop is not well-formed");
#endif

                    if (L2->contains(BBI->TrueBB)) {
                        assert(!L2->contains(BBI->FalseBB));
                    }
                    else {
                        assert(L2->contains(BBI->FalseBB));
                    }

                    break; /* The beginning of a loop is found. Stop looking.*/
                }
            }

            if (R.Loop != nullptr) /* A loop is found, stop looking.*/
                break;
        }

        if (R.Loop != nullptr) {
            // Deal with detected loop
            for (auto MBB : MBBs) {
                for (auto S : MBB->successors()) {
                    if (S != R.Loop->getHeader()) {
                        auto SBBI = GetInfo(*S);
                        assert(! SBBI->IsAligned);

                        // Duplicates are not allowed in the Succs
                        if (Set.find(S) == Set.end()) {
                            Set.insert(S);
                            R.Succs.push_back(S);
                        }
                    }
                }
            }
        }
        else {

            MachineBasicBlock *EmptyMBB = nullptr;

            // No loops found
            std::map<MachineBasicBlock *, MachineBasicBlock *> Clones; // DenseMap?
            for (auto MBB : MBBs) {
                for (auto S : MBB->successors()) {
                    if ( (R.Loop == nullptr) || (S != R.Loop->getHeader()) ) {
                        auto BBI = GetInfo(*MBB);
                        auto SBBI = GetInfo(*S);

                        // Ignore self-cycles
                        // self-cycles should have been dealt with already, just like any
                        // other loop (i.e. no single-block loop) inside a senstive region
                        assert(S != MBB && (BBI->Orig != SBBI->Orig) && "Undetected loop");

                        // !!TODO: Factor out the common logic between the three branches
                        //          (when (S == Exit), (S == Return) and (S == Aligned))
                        if (S == Exit) {

                            // Create an empty block, if has not been created before, and
                            // add CFG info and termination code. (A correct CFG is a precondition
                            // for TII->insertBranch.)
                            if (EmptyMBB == nullptr) {
                                EmptyMBB = CreateMachineBasicBlock("empty", true);
                                GetInfo(*EmptyMBB)->Orig = CloneMBB(EmptyMBB, false);
                                // Update CFG
                                EmptyMBB->addSuccessor(Exit);
                                // Add termination code
                                TII->insertBranch(*EmptyMBB, S, nullptr, {}, DebugLoc());

                                R.Succs.push_back(EmptyMBB);
                            }

                            // Update MBB
                            assert((!BBI->IsReturn) && "Blocks with successors cannot return.");
                            ReplaceSuccessor(MBB, S, EmptyMBB);

                            // Create/update CF analysis for the new/changed blocks. This analysis
                            //  is required by the alignment algo. Make sure to do this after
                            //  updating the basic block's termination code and the CFG.
                            //   (not sure if the CFG is actually used for this,
                            //      but let's be conservative)
                            ReAnalyzeControlFlow(
                                    *MBB); // TODO: Already done by ReplaceSuccessor
                            // Re-analyze because the empty MBB might be reused here.
                            ReAnalyzeControlFlow(*EmptyMBB);

                            // Loop analysis has to be redone because EmptyMBB might be part
                            // of a loop, and loop analysis should be correct for the loop
                            // detector to work correctly.
                            // TODO: Optimize (see remark at function definition)
                            // TODO: Optimize (this should be done only when EmptyMBB is created)
                            RedoAnalysisPasses();

                            assert(GetInfo(*EmptyMBB)->FallThroughBB == nullptr);
                        } else if (SBBI->IsReturn) {
                            llvm_unreachable("Canonical CFG expected");
                        } else if (SBBI->IsAligned) {
                            // Create clone - The current successor has been aligned before.
                            // Clone its original contents, if it has not been cloned before,
                            //  and add CFG info and termination code. (A correct CFG is a
                            //  precondition for TII->insertBranch.)
                            assert(SBBI->Orig != nullptr);
                            auto KV = Clones.find(SBBI->Orig);
                            MachineBasicBlock *Clone = nullptr;
                            if (KV != Clones.end()) {
                                Clone = KV->second;
                            } else {
                                LLVM_DEBUG(dbgs() << "Cloning " << GetName(SBBI->BB) << "\n");
                                Clone = CloneMBB(SBBI->Orig, true);
                                Clones[SBBI->Orig] = Clone;
                                for (auto SS : S->successors()) {
                                    Clone->addSuccessor(SS);
                                    // These successors will be cloned in turn during the next
                                    //  ComputeSuccessors call.
                                    // Ad-hoc pattern matching might prevent a cascade of cloning
                                }

                                // Update termination code
                                // TODO: Fix copy-paste from
                                //         MSP430DMADefenderPass::ReplaceSuccessor()::4
                                TII->removeBranch(*Clone);
                                if (SBBI->IsBranch) {
                                    if (SBBI->IsConditionalBranch) {
                                        TII->insertBranch(*Clone, SBBI->TrueBB, SBBI->FalseBB,
                                                          SBBI->BrCond, DebugLoc());
                                        // Update sensitivity analysis and containedness
                                        //   - HasSecretDependentBranch is set during sensitivity analysis
                                        //   - IsPartOfSensitiveRegion is set during outer region analysis
                                        GetInfo(*Clone)->HasSecretDependentBranch = true;
                                        GetInfo(*Clone)->IsPartOfSensitiveRegion = true;
                                    } else {
                                        TII->insertBranch(
                                                *Clone, SBBI->TrueBB, nullptr, {}, DebugLoc());
                                    }
                                } else {
                                    // A block with a successor cannot return
                                    assert(!SBBI->IsReturn);
                                    assert(SBBI->FallThroughBB != nullptr);
                                    TII->insertBranch(
                                            *Clone, SBBI->FallThroughBB, nullptr, {}, DebugLoc());
                                }

                                R.Succs.push_back(Clone);
                            }

                            // Update MBB
                            ReplaceSuccessor(MBB, S, Clone);

                            // Create/update CF analysis for the new/changed blocks. This
                            //  analysis
                            //  is required by the alignment algo. Make sure to do this after
                            //  updating the basic block's termination code and the CFG.
                            //   (not sure if the CFG is actually used for this,
                            //      but let's be conservative)
                            ReAnalyzeControlFlow(
                                    *MBB); // TODO: Already done by ReplaceSuccessor
                            if (KV == Clones.end()) {
                                AnalyzeControlFlow(*Clone);
                            }
                        } else {
                            // Duplicates are not allowed in Succs
                            if (Set.find(S) == Set.end()) {
                                Set.insert(S);
                                R.Succs.push_back(S);
                            }
                        }
                    }
                }
            }
        }
    }

