SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    // Check postcondition: There should be no duplicates in Succs
    //
    // Remark: It is not possible to
    // use a std::set instead of a std::vector, because this would mean
    // that the order of insertion is not maintained. The order might be relevant
    // when effectively aligning the different blocks, because the order determines
    // the order in which the individual MBBs take the role as the reference block.
    std::set<MachineBasicBlock *> S(R.Succs.begin(), R.Succs.end());
    assert(S.size() == R.Succs.size());

    LLVM_DEBUG(dbgs() << "> successors: ");
    LLVM_DEBUG(for (auto MBB: R.Succs) dbgs() << GetName(MBB) << ", ");
    LLVM_DEBUG(dbgs() << "\n");

    return R;
}

#if 0
static void DumpMF(MachineFunction &MF) {
  LLVM_DEBUG(dbgs() << "==========================\n");
  for (auto &MBB : MF) {
    LLVM_DEBUG(dbgs() << MBB);
  }
  LLVM_DEBUG(dbgs() << "==========================\n");
}
#endif

void MSP430DMADefenderPass::AlignNonTerminatingInstructions(
        std::vector<MachineBasicBlock *> L, Register UnusedReg) {
    assert(L.size() > 1);
    // Create two maps, mapping MBBs to
    //   1) instruction iterator (pointing to the beginning of the MBB)
    //   2) terminator iterator (pointing to branching code at end of MBB)
    // TODO: Map from MBB->getNumber -> MBB::iterator (and use more efficient map?)
    //         for this to work, blocks need to be correctly numbered which
    //         is currently not the case as ComputeSuccessors creates new MBBs
    std::map<MachineBasicBlock *, MachineBasicBlock::iterator> MII;
    std::map<MachineBasicBlock *, MachineBasicBlock::iterator> MTI;

    // 1) Initialize
    for (auto MBB : L) {
        // Don't add artifical blocks to BBAnalysis (by calling GetInfo) and,
        // consequently, don't mark artifical blocks as being aligned. This makes
        // sure that subsequent code safely ignores these blocks.
        // An example of an artifical block is the fingerprint block, which is used
        // to align a set of blocks with an previously aligned loop.
        if (MBB->getNumber() >= 0) {
            auto BBI = GetInfo(*MBB);
            assert(! BBI->IsAligned);
            BBI->IsAligned = true;
        }
        DebugLoc DL;
        MII[MBB] = MBB->begin();
        MTI[MBB] = MBB->getFirstTerminator();
    }

    // 2) Align non-terminating instructions
    for (auto Ref : L) {

        LLVM_DEBUG(dbgs() << "Ref: " << GetName(Ref) << "\n");
        while (MII[Ref] != MTI[Ref]) {

            DebugLoc DL; // FIXME: Where to get DebugLoc from?

            // 2.1) First check if we are dealing with a call instruction in the
            //       current iteration.
            bool isCall = false;
            auto MBBI = L.begin();
            while ( (MBBI != L.end()) && (! isCall)) {
                auto BB = *MBBI++;
                if ((MII[BB] != BB->end()) && (MII[BB] != MTI[BB])) {
                    auto &MI = *MII[BB];
                    if (MI.isCall()) {

                        // TODO: Reduce time-complexity (this is the third nested loop)
                        for (auto BB2 : L) {
                            if (BB2 != BB) {
                                CompensateCall(MI, *BB2, MII[BB2]);
                            }
                        }
                        MII[BB]++;

                        isCall = true; // A call has been found. the Terminate loop.
                    }
                }
            }

            // 2.2) Continue with the generic compensation logic for all other
            //       types of instruction when no call has been detected
            if (! isCall) {
                auto &RI = *MII[Ref]++;
                auto RIL = TII->getInstrLatency(nullptr, RI);
                LLVM_DEBUG(dbgs() << " " << RI << " (latency=" << RIL << ")\n");
                for (auto BB : L) {
                    if (BB != Ref) {
                        LLVM_DEBUG(dbgs() << "  " << GetName(BB) << ": ");
                        if (MII[BB] == BB->end()) {
                            LLVM_DEBUG(dbgs() << "insert nop (end-of-block)");
                            CompensateInstr(RI, *BB, MII[BB],UnusedReg);
                        } else if (MII[BB] == MTI[BB]) {
                            LLVM_DEBUG(dbgs() << "insert nop (begin-of-branching-code)");
                            CompensateInstr(RI, *BB, MII[BB], UnusedReg);
                        } else {
                            auto &MI = *MII[BB];
                            auto MIL = TII->getInstrLatency(nullptr, MI);
                            LLVM_DEBUG(dbgs() << MI << " (latency=" << MIL << "): ");
                            if (RIL != MIL) {
                                LLVM_DEBUG(dbgs() << "insert nop (non-matching-latency)");
                                CompensateInstr(RI, *BB, MII[BB], UnusedReg);
                            } else {
                                LLVM_DEBUG(dbgs() << "latencies match");
                                MII[BB]++;
                            }
                        }
                        LLVM_DEBUG(dbgs() << "\n");
                    }
                }
            }
        }

        assert(MII[Ref] == MTI[Ref]);
    }
}


// TODO: Generalize this implemenation. Now it is MSP430-specific and
//       only support two terminating instructions (according to the well-
//       formedness criterium).
// TODO: Optimize. It is not always necessary to assume that there are
//           always two terminating instructions...
void MSP430DMADefenderPass::CanonicalizeTerminatingInstructions(
        MachineBasicBlock *MBB) {
    auto T = MBB->getFirstTerminator();
    LLVM_DEBUG(dbgs()
                       << "Canonicalize terminating instructions: " << GetName(MBB) << "\n");
    //LLVM_DEBUG(dbgs() << *MBB);
    //LLVM_DEBUG(dbgs() << *T);
    auto BBI = GetInfo(*MBB);

    switch (BBI->TerminatorCount) {
        case 0:
            assert(! BBI->IsBranch);
            assert(BBI->FallThroughBB != nullptr);
            BuildNOP2(*MBB, T, TII);
            BuildNOP2(*MBB, T, TII);
            break;
        case 1:
            if (BBI->IsConditionalBranch) {
                assert(BBI->FallThroughBB != nullptr);
                BuildNOP2(*MBB, T, TII);
                assert(TII->getInstrLatency(nullptr, *T++) == 2);
            }
            else if (BBI->IsReturn) {
                assert(TII->getInstrLatency(nullptr, *T) == 3);
                llvm_unreachable("Canonical CFG expected");
            }
            else if (BBI->IsMultiWayBranch) {
                BuildNOP2(*MBB, T, TII);
                assert(TII->getInstrLatency(nullptr, *T++) == 2);
            }
            else {
                //LLVM_DEBUG(DumpMF(*MF));
                //LLVM_DEBUG(dbgs() << *MBB);
                assert(BBI->IsBranch);
                assert(BBI->FallThroughBB == nullptr);
                BuildNOP2(*MBB, T, TII);
                assert(TII->getInstrLatency(nullptr, *T++) == 2);
            }
            break;
        case 2:
            assert(BBI->IsConditionalBranch);
            assert(TII->getInstrLatency(nullptr, *T++) == 2);
            assert(TII->getInstrLatency(nullptr, *T++) == 2);
            break;
        default:
            llvm_unreachable("Invalid terminator count");
    }

    assert(T == MBB->end());
}

// Adds the definition with the highest id from Defs to the list of
//  candidate dependencies for the given instruction.
//  Returns true if a dependency has been added, false otherwise (empty Defs)
//
// PRE: The list of defs contains the instruction identifiers in MBB that
//   define the same register unit (RU)
// PRE: MI uses the thing that is defined
// PRE: Defs is sorted by increasing instruction id
bool MSP430DMADefenderPass::addDependency(MachineInstr *MI,
                                              MachineBasicBlock *MBB,
                                              std::vector<size_t> &Defs) {
    if (! Defs.empty()) {
        MBBInfo *BBI = GetInfo(*(MI->getParent()));
        auto IID = InstIds[MI];
        // The precondition states that the element in the back should corresponds
        //  to the instruction with the highest id.
        size_t DIID = Defs.back();
        assert(*(std::max_element(Defs.begin(), Defs.end())) == DIID);
        assert(DIID < MBB->size());
        MachineInstr *DMI = &*(std::next(MBB->begin(), DIID));
        BBI->Deps[IID].push_back(DMI);
#if 0
        LLVM_DEBUG(dbgs() << GetName(BBI->BB) << ":" << Id << " depends on "
               << GetName(MBB) << ":" << DIID << "\n");
#endif
        return true;
    }

