SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    return false;
}

// Locates the instruction dependencies in a machine basic block of the given
// instruction MI with respect to the given register unit RU
// This method maintain a "visit list" to avoid endless recursion because of
// cycles in the CFG.
//  PRE: MI uses RU
//  PRE: MBB reaches MI
// TODO: Write unit test for ComputeDependencies
void MSP430DMADefenderPass::ComputeDependencies(
        MachineInstr *MI, size_t RU, MachineBasicBlock *MBB,
        SmallPtrSetImpl<MachineBasicBlock *> &Visited) {
    if (Visited.find(MBB) != Visited.end())
        return;

    Visited.insert(MBB);

    assert(MI != nullptr);
    assert(MBB != nullptr);
    assert(MI->getParent() != nullptr);
    MBBInfo *BBI = GetInfo(*(MI->getParent()));
    assert(BBI != nullptr);
    assert(InstIds.find(MI) != InstIds.end());
    auto IID = InstIds[MI];
    // Id is used to index BBI->Deps, assert it is within its bounds
    assert(IID < BBI->Deps.size());
    if (BBI->BB == MBB) {
        // If the MI's MBB defines the RU itself, register the def if the def site
        //  comes before MI. Don't look at the predecessors and leave early when
        //  this is the case.
        auto V = GetDefsBefore(BBI, RU, IID);
        if (addDependency(MI, MBB, V)) {
            // There is an instruction before MI in MI's MBB that defines RU
            return;
        }
    }

#if 0
    // TODO
  if (MBB->pred_size() == 0) {
    LLVM_DEBUG(dbgs() << "WARNING: Unitialized reg found\n");
  }
#endif

    for (MachineBasicBlock *PMBB : MBB->predecessors()) {
        auto PBBI = GetInfo(*PMBB);
        if (PMBB == MBB) {
            // Self-cycles can be safely ignored unless MBB is the MI's parent.
            if (BBI->BB == MBB) {
                if (GetDefsBefore(BBI, RU, IID).empty()) {
                    // If addDependency returns true, then there is an instruction after
                    //  MI in MI's MBB that defines RU.
                    //  Since this is a cycle, this def reaches MI.
                    auto V = GetDefsAfter(BBI, RU, IID);
                    (void) addDependency(MI, MBB, V);
                }
            }
            // Don't recurse for self-cycles
        }
        else {
            assert(RU < PBBI->Defs.size());
            if (! addDependency(MI, PMBB, PBBI->Defs[RU])) {
                // Recursion terminates when the entry MBB has been reached
                //  since the entry MBB does not have any predecessors
                ComputeDependencies(MI, RU, PMBB, Visited);
            }
        }
    }
}

// The results are stored as dependencies between machine instructions which
//  is enough to implement the DMA defense.
void MSP430DMADefenderPass::ComputeReachingDefs() {
    // Compute reaching definitions
    for (auto &&KV : BBAnalysis) {
        MBBInfo &BBI = KV.second;
        for (MachineInstr &MI : BBI.BB->instrs()) {
            for (MachineOperand &MO : MI.operands()) {
                // TODO: To be portable, deal with two-operand instructions whers
                //         a register can be both defined and used
                if (MO.isReg() && MO.isUse()) {
                    assert(! MO.isDef());
                    MCRegUnitIterator RUI(MO.getReg(), TRI);
                    assert(RUI.isValid());
                    auto RU = *RUI;
                    ++RUI;
                    assert(!RUI.isValid());
                    assert(RU < TRI->getNumRegUnits());
                    assert(RU < BBI.Defs.size());

                    SmallPtrSet<MachineBasicBlock *, 4> Visited;
                    ComputeDependencies(&MI, RU, BBI.BB, Visited);
                }
                else {
                    // TODO: Do something similar for stack slots
                    // if (MO.isFI()) ...
                }
            }
        }
    }
}

bool MSP430DMADefenderPass::IsSecretDependent(MachineInstr *MI) {
    return SensitivityInfo.find(MI) != SensitivityInfo.end();
}

bool MSP430DMADefenderPass::IsSecretDependent(MBBInfo *BBI) {
    return BBI->HasSecretDependentBranch;
}

// Marks the given machine instruction as sensitive
void MSP430DMADefenderPass::Taint(MachineInstr * MI) {

    //LLVM_DEBUG(dbgs() << GetName(MI->getParent()) << ": Tainting instruction " << *MI);
    SensitivityInfo.insert(MI);

    for (auto &MMO : MI->memoperands()) {
        if (MMO->isStore()) {
            if (const Value *Val = MMO->getValue()) {
                //LLVM_DEBUG(dbgs() << GetName(MI->getParent()) << ": Tainting value " << *Val);
                SensitivityInfo2.insert(Val);
            } else if (MMO->getPseudoValue()) {
                //} else if (const PseudoSourceValue *PVal = MMO->getPseudoValue()) {
                // See MachineOperand::print (lib/CodeGen/MachineOperand.cpp)
                llvm_unreachable("Unhandled memory access");
            }
        }
    }

    if (MI->isConditionalBranch()) {
        assert(MI->getParent() != nullptr);
        auto L = MLI->getLoopFor(MI->getParent());
        /* Loop latches are treated differently than ordinary branches and are not
         *  considered "ordinary" secret dependent branches.
         */
        if (L == nullptr || (! L->isLoopLatch(MI->getParent()))) {
            auto BBI = GetInfo(*MI->getParent());
            BBI->HasSecretDependentBranch = true;
            HasSecretDependentBranch = true;
        }
    }
}

// An instruction I is part of a sensitive region S if
//   - the entry node of S is a predecessor of I's parent
//   - the exit node of S post-dominates I
//
// TODO: OPTIMIZE
//        - Avoid checking this again for every instruction in a block !
//        - Are there better ways to compute this information ?
//           (is it possible to compute MBBInfo::IsPartOfSensitiveRegion earlier
//             and use the result of that analysis (if this is the case,
//             this method only needs to check wether MI's parent's BBInfo
//             has this flag set to true)
bool
MSP430DMADefenderPass::IsPartOfSensitiveRegion(const MachineInstr *MI) {
    bool Result = false;

    auto MBB = MI->getParent();
    assert(MBB != nullptr);

