SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    std::vector<MachineBasicBlock *> Preds(MBB->pred_begin(), MBB->pred_end());
    SmallPtrSet<MachineBasicBlock *, 4> Visited;

    while ( (! Preds.empty()) && (! Result) ) {
        auto PMBB = Preds.back();
        Preds.pop_back();
        if (Visited.find(PMBB) == Visited.end()) {
            Preds.insert(Preds.end(), PMBB->pred_begin(), PMBB->pred_end());
            Visited.insert(PMBB);
            auto BBI = GetInfo(*PMBB);
            if (BBI->HasSecretDependentBranch) {
                auto IPDom = (*MPDT)[PMBB]->getIDom();
                if (IPDom->getBlock() != nullptr) {
                    if (MPDT->properlyDominates(IPDom->getBlock(), MBB)) {
                        Result = true;
                    }
                }
                else {
                    // If we get here, the entry node of a sensitive region does not
                    // have an immediate dominator. Conforming to the well-formedness
                    // criterion, this is only possible if the sensitive region contains a
                    // return node,
                    //  (TODO: Verify this assumption)
                    // in which case, the canonical exit node should act as
                    // the immediate dominator. This makes the given instruction
                    // part of the sensitive region because:
                    //   (1) the secret-dependent node reaches the instruction and
                    //   (2) the unique canonical exit node is the immediate dominator
                    //       of the secret-dependent node and
                    //   (3) the unique canonical exit node dominates every node in the
                    //       CFG, including the parent of the given instruction

                    // Create the canonical exit node when it has not been created before
                    if (CanonicalExit == nullptr) {
                        CanonicalExit = CreateMachineBasicBlock("exit", true);
                        DebugLoc DL; // FIXME: Where to get DebugLoc from?
                        BuildMI(CanonicalExit, DL, TII->get(MSP430::RET));
                    }

                    Result = true;
                }
            }
        }
    }

    return Result;
}

// Safe sensitivity analysis (uses use-def chain, the result of the
//  reaching definitions analysis) to statically track confidential
//  information. At first, only analyze registers, and conservatively
//  consider the rest as secret. To be extended
//  to stack slots and global variables.
//
// During sensitivity analysis, it is also determined whether the CFG needs to be
// canonicalized, i.e. transformed to a CFG with a single exit point (via calls
// to IsPartOfSensitiveRegion()). This analysis could not be done earlier,
// because there was no sensitivity info yet.
//
// !TODO: Desperately needs optimization
//         - Implement this as a worklist algo (needs a def-use chain)
//         - Store the sensitivity info in MBBInfo instead of a MF-level set?
void MSP430DMADefenderPass::PerformSensitivityAnalysis() {
    size_t N = 0;
    while ((SensitivityInfo.size() + SensitivityInfo2.size()) > N) {
        N = SensitivityInfo.size() + SensitivityInfo2.size();
        for (auto &MBB : *MF) {
            // Ignore the canonical exit node. Code asserts because the reaching def
            // analysis has not been performed on this node. (Fix this?)
            if (&MBB == CanonicalExit)
                continue;

            //LLVM_DEBUG(dbgs() << MBB);
            auto BBI = GetInfo(MBB);
            for (auto &MI : MBB.instrs()) {
                auto IID = InstIds[&MI];
                assert(IID < BBI->Deps.size());
                if (SensitivityInfo.find(&MI) == SensitivityInfo.end()) {

                    if (MI.isInlineAsm()) {
                        //TODO: llvm_unreachable("Inline assembly is not supported");
                        continue;
                    }

                    if (MI.isCall()) {
                        // TODO: the call should only be marked sensitive if one of the
                        //       actual parameters is marked sensitive
                        Taint(&MI);
                        //continue;
                    }

#if 0
                    if (MI.mayLoad()) {
            Taint(&MI);
          }
#endif

                    // Mark every conditional branch that is part of a sensitive region
                    // senstive in turn. (except for loop latches, see Taint())
                    if (MI.isConditionalBranch()) {
                        if (IsPartOfSensitiveRegion(&MI)) {
                            Taint(&MI);
                        }
                    }

                    for (auto &MMO : MI.memoperands()) {
                        if (MMO->isLoad()) {
                            if (const Value *Val = MMO->getValue()) {
                                if (SensitivityInfo2.find(Val) != SensitivityInfo2.end()) {
                                    Taint(&MI);
                                }
                            }
                        } else if (MMO->getPseudoValue()) {
                            //} else if (const PseudoSourceValue *PVal = MMO->getPseudoValue()) {
                            // See MachineOperand::print (lib/CodeGen/MachineOperand.cpp)
                            llvm_unreachable("Unhandled memory access");
                        }
                    }

                    for (auto &MO : MI.operands()) {
                        if (SensitivityInfo.find(&MI) != SensitivityInfo.end()) {
                            break;
                        }
                        // !TODO: Gradually support more cases, by adding more test
                        //         cases
                        switch (MO.getType()) {

                            case MachineOperand::MO_Register         :
                                if (MO.isUse()) {
                                    for (auto DMI : BBI->Deps[IID]) {
                                        if (IsSecretDependent(DMI)) {
                                            Taint(&MI);
                                        }
                                    }
                                }
                                if (MO.isDef()) {
                                    // Any assignment in a sensitive region taints the assigned
                                    // variable.
                                    if (IsPartOfSensitiveRegion(&MI)) {
                                        Taint(&MI);
                                    }
                                }
                                break;

                            case MachineOperand::MO_Immediate        :
                            case MachineOperand::MO_CImmediate       :
                            case MachineOperand::MO_FPImmediate      :
                                // Immediates don't leak information
                                break;

