SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
                            case MachineOperand::MO_MachineBasicBlock:
                                // Used by (un)conditional jumps
                                break;

                            case MachineOperand::MO_GlobalAddress    :
                            case MachineOperand::MO_MCSymbol         :
                                // Be conservative and mark as sensitive
                                Taint(&MI);
                                break;

                                // TODO: Gradually support more operand types
                            case MachineOperand::MO_ExternalSymbol   :
                            case MachineOperand::MO_ConstantPoolIndex:
                            case MachineOperand::MO_FrameIndex       :
                            case MachineOperand::MO_BlockAddress     :
                            case MachineOperand::MO_TargetIndex      :
                            case MachineOperand::MO_JumpTableIndex   :
                            case MachineOperand::MO_RegisterMask     :
                            case MachineOperand::MO_RegisterLiveOut  :
                            case MachineOperand::MO_Metadata         :
                            case MachineOperand::MO_CFIIndex         :
                            case MachineOperand::MO_IntrinsicID      :
                            case MachineOperand::MO_Predicate        :
                            default:
#if !defined(NDEBUG) || defined(LLVM_ENABLE_DUMP)
                                LLVM_DEBUG(dbgs() << GetName(&MBB) << "\n");
                                MI.dump();
#endif
                                llvm_unreachable("Unknown operand type");
                        }
                    }
                }
            }
        }
    }
}

#if 0
// Matchess the fork pattern. Typical for this pattern is that the branches
// never join again.
//
//       EMBB
//      _/ \_
//      |   |
//      |  RBB1---> exit
//      |
//     LBB2
//
// !TODO: Generalize the fork pattern
bool MSP430DMADefenderPass::MatchFork(MBBInfo &EBBI) {
  MBBInfo *TBBI = GetInfo(*EBBI.TrueBB);
  MBBInfo *FBBI = GetInfo(*EBBI.FalseBB);

  assert(TBBI != FBBI);

  if (TBBI->IsReturn && FBBI->IsReturn) {
    EBBI.BClass = BCFork;
    auto &F = EBBI.BCInfo.Fork;
    F.LeftBB = TBBI->BB;
    F.RightBB = FBBI->BB;
    return true;
  }

  return false;
}

// Matches the triangle pattern.
//
//   Diverges on true edge:       Diverges on false edge:
//
//           EMBB                         EMBB
//           | \_                         | \_
//           |  |                         |  |
//           | TMBB                       | FMBB
//           |  /                         |  /
//           FMBB                         TMBB
//
// !TODO: Generalize the triangle pattern
bool MSP430DMADefenderPass::MatchTriangle(MBBInfo &EBBI, bool DivOnFalse) {
  MBBInfo *DivBBI = GetInfo(*EBBI.TrueBB);
  MBBInfo *JoinBBI = GetInfo(*EBBI.FalseBB);
  if (DivOnFalse) {
    DivBBI = GetInfo(*EBBI.FalseBB);
    JoinBBI = GetInfo(*EBBI.TrueBB);
  }

  if (DivBBI->Next == JoinBBI->BB) {
    EBBI.BClass = BCTriangle;
    auto &T = EBBI.BCInfo.Triangle;
    T.DivBB = DivBBI->BB;
    T.JoinBB = JoinBBI->BB;
    return true;
  }

  return false;
}

// Matches the diamond pattern.
//
//       EMBB
//      _/ \_
//      |   |
//    LMBB RMBB
//       \ /
//      JMBB
//
// !TODO: Generalize the triangle pattern
bool MSP430DMADefenderPass::MatchDiamond(MBBInfo &EBBI) {
  return false;
}

// The branch classifier considers only 'sensitive' basic blocks as starting
//  points of the analysis. The result of this classification is input for
//  the alignment code generator.
void MSP430DMADefenderPass::ClassifyBranches() {
  for (auto &&KV : BBAnalysis) {
    MBBInfo &BBI = KV.second;
    if (IsSecretDependent(&BBI)) {
      // Preconditions for matching functions
      assert(BBI.IsAnalyzable);
      assert(BBI.IsConditionalBranch);
      assert(BBI.TrueBB != nullptr);
      assert(BBI.FalseBB != nullptr);
      assert(BBI.TrueBB != BBI.FalseBB);
      if (!MatchFork(BBI))
      if (!MatchDiamond(BBI))
      if (!MatchTriangle(BBI, true))
      if (!MatchTriangle(BBI, false)) {
#if 0
        BBI.BB->dump();
        llvm_unreachable("TODO: Support more branch pattern classes");
#endif
      }
    }
  }
}
#endif

// ! TODO: Figure out if inserting (or removing) an element into an ilist does
//         not invalidate iterators or pointers to other elements in the list.
//
// Inserts a compensation instruction before the given position in the given
// MachineBasicBlock.
//
// TODO: Verify correctness of these nops (see also the note in the MSP430x1xx
//                                            Family User's guide).
//
void MSP430DMADefenderPass::CompensateInstr(const MachineInstr &MI,
                                                MachineBasicBlock &MBB,
                                                MachineBasicBlock::iterator I,
                                                Register UnusedReg) {

    auto instr_class = TII->getInstrMemTraceClass(nullptr, MI);
    if (MI.isAnnotationLabel())
        return;

    // TODO: This code is MSP430-specific. It must be target-independent and
    //        should probably be described in the target description files.
    // TODO: What about non-deterministic Sancus crypto instructions?
    /*DebugLoc DL;
    BuildMI(MBB, I, DL, TII->get(MSP430::MOV16rc), MSP430::CG).addImm(2);*/
    switch (instr_class) {
        case 10:
            Build_1_0_0_1(MBB, I, TII, UnusedReg);
            break;
        case 20:
            Build_2_00_00_11(MBB, I, TII, UnusedReg);
            break; //MOV
        case 21:
            Build_2_00_10_01(MBB, I, TII, UnusedReg);
            break;
        case 30:
            Build_3_000_010_101(MBB, I, TII, UnusedReg);
            break; //CMP
        case 31:
            Build_3_000_101_001(MBB, I, TII, UnusedReg);
            break;
        case 32:
            Build_3_000_001_001(MBB, I, TII, UnusedReg);
            break;
        case 33:
            Build_3_000_100_000(MBB, I, TII, UnusedReg);
            break;
        case 40:
            Build_4_0000_0101_1001(MBB, I, TII, UnusedReg);
            break;
        case 41:
            Build_4_0000_0001_1001(MBB, I, TII, UnusedReg);
            break;
        case 50:
            Build_5_00000_00101_11001(MBB, I, TII, UnusedReg);
            break;
        case 51:
            Build_5_00000_10101_10001(MBB, I, TII, UnusedReg);
            break;
        case 52:
            Build_5_00000_00001_11001(MBB, I, TII, UnusedReg);
            break;
        case 53:
            Build_5_00000_10001_10001(MBB, I, TII, UnusedReg);
            break;
        case 54:
            Build_5_00000_10000_00000(MBB, I, TII, UnusedReg);
            break;
        case 60:
            Build_6_000000_010101_110001(MBB, I, TII, UnusedReg);
            break;
        case 61:
            Build_6_000000_010001_110001(MBB, I, TII, UnusedReg);
            break;
        default:
#if !defined(NDEBUG) || defined(LLVM_ENABLE_DUMP)
            MI.dump();
#endif
            llvm_unreachable("Unexpected memory trace class");
    }
}

