SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
#define PREFIX_NEMDEF_SECURE "_nds_"
#define PREFIX_NEMDEF_DUMMY  "_ndd_"

// Compensates the call with a call to a dummy and secure transformation of
//  the callee
void MSP430DMADefenderPass::CompensateCall(const MachineInstr &Call,
                                               MachineBasicBlock &MBB,
                                               MachineBasicBlock::iterator I) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    assert(Call.isCall());

    std::string * N = new std::string(); // TODO: Fix mem leak ?

    const MachineOperand &MO = Call.getOperand(0);
    switch (Call.getOpcode()) {
        case MSP430::CALLi:
            switch (MO.getType()) {
                case MachineOperand::MO_ExternalSymbol:
                    N->append(MO.getSymbolName());
                    break;
                case MachineOperand::MO_GlobalAddress :
                    N->append(std::string(MO.getGlobal()->getName()));
                    break;
                default:
                    llvm_unreachable("Usupported machine operand");
            }

            // TODO: Avoid string manipulation
            if (N->find(PREFIX_NEMDEF_DUMMY) > 0) {    // Read as: "if not startswith"
                if (N->find(PREFIX_NEMDEF_SECURE) == 0) {// Read as: "if startswith"
                    N->erase(0, strlen(PREFIX_NEMDEF_SECURE));
                }
                N->insert(0, PREFIX_NEMDEF_DUMMY);
            }

            LLVM_DEBUG(dbgs()
                               << "  " << GetName(&MBB) << ": insert call (" << N->c_str() << ")\n");
            BuildMI(MBB, I, DL, TII->get(MSP430::CALLi)).addExternalSymbol(N->c_str());
            break;

#if 0
            // Sancus out calls
    case MSP430::BRCALLr:
      break;
#endif

        case MSP430::CALLm:
        case MSP430::CALLn:
        case MSP430::CALLp:
        case MSP430::CALLr:
        default:
            LLVM_DEBUG(dbgs() << "OPCODE=" << Call.getOpcode() << "\n");
            llvm_unreachable("Usupported call");
    }
}

#if 0
bool
MSP430DMADefenderPass::IsEnryOfPattern(MBBInfo &BBI, BranchClass BClass) {
  return BBI.IsAnalyzable
    && BBI.IsConditionalBranch
    && BBI.HasSecretDependentBranch
    && (BBI.BClass == BClass);
}

// Inserts compensation instructions in Target at position TI for the
//  instructions starting from SI in Source
// Returns the target iterator TI
MachineBasicBlock::iterator
MSP430DMADefenderPass::AlignBlock(MachineBasicBlock &Source,
                                      MachineBasicBlock::iterator SI,
                                      MachineBasicBlock &Target,
                                      MachineBasicBlock::iterator TI) {

  while (SI != Source.end()) {
    if (! TII->isUnpredicatedTerminator(*SI)) { // TODO: replace by isTerminator()?
      CompensateInstr(*SI, Target, TI);
    }
    SI++;
  }
  return TI;
}

// Returns the position in MBB right before the branching code at the end
// TODO: Why not use MBB->getFirstTerminator()
MachineBasicBlock::iterator MSP430DMADefenderPass::
GetPosBeforeBranchingCode(MachineBasicBlock *MBB) const {
  if (MBB->begin() == MBB->end())
    return MBB->begin();

  MachineBasicBlock::iterator MBBI = MBB->end();
  while (MBBI != MBB->begin()) {
    MBBI--;
    if (! MBBI->isDebugInstr()) {
      if (! TII->isUnpredicatedTerminator(*MBBI)) {
        break;
      }
    }
  }

  return ++MBBI;
}

void MSP430DMADefenderPass::AlignDiamond(MBBInfo &EBBI) {
}

void MSP430DMADefenderPass::AlignFork(MBBInfo &EBBI) {
  assert(IsEnryOfPattern(EBBI, BCFork));

  auto EBB = EBBI.BB;
  auto &F = EBBI.BCInfo.Fork;

  // Fork sanity checks
  assert(EBB->succ_size() == 2);
  assert(EBB->isSuccessor(F.LeftBB));
  assert(EBB->isSuccessor(F.RightBB));

  // Temporary assumptions
  assert(F.RightBB->isReturnBlock());
  assert(F.LeftBB->isReturnBlock());

  auto RBBI = AlignBlock(*F.LeftBB, F.LeftBB->begin(), *F.RightBB,
                         F.RightBB->begin());
  AlignBlock(*F.RightBB, RBBI, *F.LeftBB, GetPosBeforeBranchingCode(F.LeftBB));
}

void MSP430DMADefenderPass::AlignTriangle(MBBInfo &EBBI) {
  assert(IsEnryOfPattern(EBBI, BCTriangle));

  auto EBB = EBBI.BB;
  auto &T = EBBI.BCInfo.Triangle;

  // Triangle sanity checks
  assert(EBB->succ_size() == 2);
  assert(EBB->isSuccessor(T.DivBB));
  assert(EBB->isSuccessor(T.JoinBB));

  // Temporary assumptions
  assert(T.DivBB->succ_size() == 1);
  assert(T.DivBB->isSuccessor(T.JoinBB));

  // !TODO: Align the following branching code at the end of the entry
  //        block EBB:
  //                   JC TBB
  //                   J  FBB
  //      This is necessary because the unconditional branch is only executed
  //       for the false case

  // 1) Insert a new MBB
  auto NewBB = CreateMachineBasicBlock();
  MF->insert(MF->end(), NewBB);

  // 2) Update the CFG information (MBB.Successors and MBB.Predecessors)
  EBB->replaceSuccessor(T.JoinBB, NewBB);
  NewBB->addSuccessor(T.JoinBB);
  //NewBB->CorrectExtraCFGEdges();
  //EBB->CorrectExtraCFGEdges();

  // 3) Generate the actual alignment code
  TII->removeBranch(*T.DivBB); // Ignore the branching code at the end of DivBB
  for (auto &MI : *T.DivBB) {
    CompensateInstr(MI, *NewBB, NewBB->end());
  }

  // 4) Insert the necessary branching code at the end of the relevant MBBs
  //     to reflect the new CFG. To avoid generating alignment code for
  //     this branching code, make sure this is done after generating the
  //     alignment code.
  // TODO: The branch code must not perform possible "fallthrough-optimizations"
  //        for the DMA defense to work properly (check that this is the
  //        case)
  // TODO: Where to get the DebugLocs from?
  //
  //    4.1) EBB
  TII->removeBranch(*EBB);
  if (T.DivBB == EBBI.TrueBB) {
    TII->insertBranch(*EBB, T.DivBB, NewBB, EBBI.BrCond, DebugLoc());
  } else {
    TII->insertBranch(*EBB, NewBB, T.DivBB, EBBI.BrCond, DebugLoc());
  }
  //    4.2) NewBB
  TII->insertUnconditionalBranch(*NewBB, T.JoinBB, DebugLoc());

  //    4.3) DivBB
  //          Force an unconditional jump. Any possible branch code has been
  //          removed at the start of step 3).
  TII->insertUnconditionalBranch(*T.DivBB, T.JoinBB, DebugLoc());
}
#endif

// PRE: Entry is the entry point of a senstive branch
//
// The immediate post-dominator of Entry is the exit block of the sensitive
//  region.
MachineBasicBlock *
MSP430DMADefenderPass::GetExitOfSensitiveBranch(MachineBasicBlock *Entry) {
    assert(IsSecretDependent(GetInfo(*Entry)));
    assert((*MPDT).getNode(Entry) != nullptr);
    auto IPDom = (*MPDT)[Entry]->getIDom(); // Immediate post-dominator
    assert(IPDom->getBlock() != nullptr && "Canonical CFG expected");
    return IPDom->getBlock();
}

// Canonicalizes the sensitive loop
//
// It is important that this is done exactly once for every sensitive loop.
//   Canonicalization happens during a call to AlignContainedRegions which gets
//   called exactly once for every sensitive loop.
//
// ----------------------------------------------------------------------------
// Important principle to make sure the rest of the implementation does not
// get overly complicated:
//   => Once a region is aligned, it may not be changed anymore
// ----------------------------------------------------------------------------
//
// This method is called exactly once for each sensitive loop
//
// Adds a
//   - dummy preheader
//   - dummy exit
//   - dummy latch
void MSP430DMADefenderPass::CanonicalizeSensitiveLoop(MachineLoop *Loop) {
    auto Preheader = Loop->getLoopPreheader();
    auto Header = Loop->getHeader();
    auto Exit = Loop->getExitBlock();
    auto Latch = Loop->getLoopLatch();

    // Verify relevant parts of the well-formedness criterion
    assert(Preheader != nullptr);
    assert(Header != nullptr);
    assert(Latch != nullptr);
    assert(Exit != nullptr);

    DebugLoc DL; // FIXME: Where to get DebugLoc from?

