SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    LLVM_DEBUG(dbgs() << "Canonicalize sensitive loop (H=" << GetName (Header) << ")\n");

    // 1) Create a new canonical loop preheader
    assert(Preheader->succ_size() == 1);
    assert(Preheader->isSuccessor(Header));
    auto NewPreheader = CreateMachineBasicBlock("loop-pheader", true);
    auto BBIPH = GetInfo(*NewPreheader);
    BBIPH->IsPartOfSensitiveRegion = true;
    BBIPH->IsCanonicalLoopBlock = true;
    // Compensate for (see AlignFingerprint)
    //   - push of induction register (MSP430::PUSH16r)
    //   - initialization of induction register to zero (MSP430::MOV16rc)
    BuildNOP3(*NewPreheader, NewPreheader->end(), TII);
    BuildNOP1(*NewPreheader, NewPreheader->end(), TII);
    NewPreheader->addSuccessor(Header);
    TII->insertBranch(*NewPreheader, Header, nullptr, {}, DL);
    ReplaceSuccessor(Preheader, Header, NewPreheader);

    // 2) Canonicalize the header block
    assert(Header->pred_size() == 2); // Preheader + latch
    auto BBIH = GetInfo(*Header);
    assert(BBIH->IsPartOfSensitiveRegion && "Sensitive loop expected");

    // 3) Canonicalize the latch block
    // Compensate for, just before the first terminator, (see AlignFingerprint)
    //   - the increment of induction register (MSP430::ADD16rc)
    //   - the comparison of the trip count with induction register
    //       (MSP430::CMP16ri or MSP430::CMP16rc)
    auto LT = Latch->getFirstTerminator();
    assert(LT != nullptr); // Guaranteed by well-formedness criterion, verified
    //  by ComputeSuccessors. Every latch block should
    //  have two successors, the loop header and the loop
    //  exit block.
    BuildNOP1(*Latch, LT, TII);
    if (isCGConstant(BBIH->TripCount)) {
        BuildNOP1(*Latch, LT, TII);
    } else {
        BuildNOP2(*Latch, LT, TII);
    }
    // Make sure that there are exacaly two terminating instructions
    //   - one conditional jump to header
    //   - one unconditional jump to exit
    assert(Latch->succ_size() == 2);
    assert(Latch->isSuccessor(Header));
    assert(Latch->isSuccessor(Exit));

    // 4) Create a new canonical loop exit block
    auto NewExit = CreateMachineBasicBlock("loop-exit", true);
    auto BBIE = GetInfo(*NewExit);
    BBIE->IsPartOfSensitiveRegion = true;
    BBIE->IsCanonicalLoopBlock = true;
    // Compensate for pop of induction register (see AlignFingerprint)
    //       (MSP430::POP16r, emulated by MSP430::MOV16rp)
    BuildNOP2(*NewExit, NewExit->end(), TII);
    NewExit->addSuccessor(Exit);
    TII->insertBranch(*NewExit, Exit, nullptr, {}, DL);
    ReplaceSuccessor(Latch, Exit, NewExit);

    // (Re)do the necessary analyses
    AnalyzeControlFlow(*NewExit);
    AnalyzeControlFlow(*NewPreheader);
    RedoAnalysisPasses(); // TODO: Optimize, by manually updating the MLI
    //         according to this canonicalization
    // (=> update loop preheader and exit blocks)

    // Call CanonicalizeTerminatingInstructions here on the header, because the
    //   sensitive loop region should be completely aligned when the fingerprint
    //   is to be computed. AlignFingerprint depends on the principle:
    //             "aligned regions cannot change anymore"
    // It is important to canonicalize the terminating instructions after
    //  connecting the new preheader to the header (and creating an explicit
    //  unconditional jump)
    CanonicalizeTerminatingInstructions(Header);
}

static MachineLoop *
getLoopForHeader(MachineLoopInfo *MLI, MachineBasicBlock *Header) {
    auto L = MLI->getLoopFor(Header);
    assert(L != nullptr);
    assert(L->getHeader() != nullptr);
    assert(L->getHeader() == Header);
    return L;
}

// Remark: Recomputes analysis passes
void MSP430DMADefenderPass::AlignContainedRegions(MachineLoop *Loop)
{
    auto Header = Loop->getHeader();
    assert(Header != nullptr);

    // First canonicalize this sensitive loop
    auto BBIH = GetInfo(*Header);
    assert(BBIH->IsPartOfSensitiveRegion);
    CanonicalizeSensitiveLoop(Loop);

    // !TODO: Factor out "for (auto &&KV : BBAnalysis)" for-loop from
    //         AlignSensitiveBranches() and this one
    for (auto &&KV : BBAnalysis) {
        MBBInfo &BBI = KV.second;
        auto L = MLI->getLoopFor(BBI.BB);
        if (L != nullptr) {
            if (L == Loop) {
                if (IsSecretDependent(&BBI)) {
                    // Deal with this "directly contained" sensitive branch
                    AlignSensitiveBranch(BBI); // Recursive call (indirect)
                }
            } else if (L->getParentLoop() == Loop) {
                // Deal with this "directly contained" loop
                //LLVM_DEBUG(dbgs() << "Nested loop: " << GetName(L->getHeader()) << "\n");

                // According to the well-formedness criterion for loops, a loop
                // forms a SESE-region. This requires the following properties to hold:
                //  - there is a unique header
                //  - there is a unique latch
                //  - the loop header has one predecessor, the loop preheader
                //  - there is a unique exit, which is one of the two possible
                //    successors of the latch
                // This means we can just recurse here.
                // This could have been implemented differently (without recursion)
                // by iterating over all contained sensitive regions, not only the
                // directly contained ones. Intuitevely, it feels better to make a
                // distinction here as it is easier to extend when the well-formedness
                // criterion might be relaxed?
                AlignContainedRegions(L);
            }

            // Both AlignSensitiveBranch() and AlignContainedRegions() might
            //  give rise the recomputing the analysis passes
            // TODO: Make this less error prone and optimize this (see remark RedoAnalysisPasses)
            Loop = getLoopForHeader(MLI, Header);
        }
    }
}

// Aligns all MBBs with the given fingerprint
//
//   Loopification code that is generated by this method is already compensated
//   for in the original loop by the "sensitive loop canonicalization" phase
//     (see CanonicalizeSensitiveLoop)
//
// Returns the list of successors of all sensitive regions, including the newly
//  ceated ones (the exit blocks in the case of loop regions). This is required
//  for the next call to ComputeSuccessors to compute the successors based on
//  the correct set.
//
// Remark: Recomputes analysis passes
//
// TODO: Generalize to support arbitary regions (e.g. can be used as primitive
//     for ad-hoc, pattern-based optimizations (see notes))
//
// TODO: Optimize generated code for size, by
//   1) putting the generated loop in a separate block and
//   2) generating calls to this block
std::vector<MachineBasicBlock *>
MSP430DMADefenderPass::AlignFingerprint(
        std::vector<MachineBasicBlock *> FP, std::vector<MachineBasicBlock *> MBBs) {

    std::vector<MachineBasicBlock *> Result;

    assert(FP.size() > 0);
    assert(MBBs.size() > 0);

    // - Pick an arbitrary register to act as the "induction register"
    //     TODO: Optimize: use one that is not live
    unsigned IReg = MSP430::R10;

    LLVM_DEBUG(dbgs() << ">> Align fingerprint: FP= ");
    LLVM_DEBUG(for (auto FPMBB : FP) dbgs() << GetName(FPMBB) << ",");
    LLVM_DEBUG(dbgs() << " MBBs=");
    LLVM_DEBUG(for (auto MBB : MBBs) dbgs() << GetName(MBB) << ",");
    LLVM_DEBUG(dbgs() << "\n");

    // When the last block of the fingerprint is a loop latch, push
    //  loop-exit block to the result
    auto BBI = GetInfo(*FP.back());
    if (BBI->IsLoopLatch) {
        auto Loop = MLI->getLoopFor(FP.back());
        assert(Loop != nullptr);
        assert(Loop->getLoopLatch() == FP.back());
        auto Exit = Loop->getExitBlock();
        assert(Exit != nullptr && "Well-formed loop expected");
        assert(GetInfo(*Exit)->IsCanonicalLoopBlock);
        Result.push_back(Exit);
    } else {
        Result.push_back(FP.back());
        llvm_unreachable("Non loop fingerprints not supported yet");
        // TODO: Requires changes to the computation of the Result vector
    }

