SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    Register UnusedReg = FindUnusedRegisters(MBBs);

    // Align each of the MBBs with the fingperprint
    for (auto MBB : MBBs) {

        DebugLoc DL; // FIXME: Where to get DebugLoc from?

        MachineBasicBlock *PrevMBB = nullptr;
        std::vector<MachineBasicBlock *> Headers;

        // Iterate over the fingerprint blocks
        for (auto FPMBB : FP) {

            auto FPBBI = GetInfo(*FPMBB);
            assert(FPBBI->IsPartOfSensitiveRegion);

            // Ignore canonical loop blocks of nested loops to avoid creating a BB
            // twice for them, since the pre-header and exit blocks are always
            //  (as in hardcoded) created by this method.
            //  (No need to do this for the outer most loop because the canonical
            //  loop blocks of the outer most loop are not part of the fingerprint).
            if (! FPBBI->IsCanonicalLoopBlock) {

                // Create a dummy MBB to align with this fingerprint block
                //  and insert it into the CFG
                auto CurMBB = CreateMachineBasicBlock("align-fp", true);
                auto CurBBI = GetInfo(*CurMBB);
                CurBBI->Orig = CloneMBB(CurMBB, false);
                CurBBI->IsPartOfSensitiveRegion = true;
                if (PrevMBB == nullptr) {
                    assert(FPBBI->IsLoopHeader);
                    auto Loop = getLoopForHeader(MLI, FPMBB);
                    assert(Loop != nullptr);
                    assert(MBB->pred_size() >= 1);
                    std::vector<MachineBasicBlock *> L;
                    for (auto Pred : MBB->predecessors()) {
                        if (GetInfo(*Pred)->IsAligned) {
                            // !!!!!!!TODO: Make sure this is well-understood
                            //       (wrt nemdef-region-loop-loop-tail-O3.mir)
                            //if (! MDT->dominates(Loop->getHeader(), Pred)) {
                            L.push_back(Pred);
                        }
                    }
                    for (auto Pred : L) {
                        // Update CFG must be done outside of previous for loop,
                        //  as it invalidates the Pred iterator
                        ReplaceSuccessor(Pred, MBB, CurMBB);
                    }
                }
                else {
                    ReplaceSuccessor(PrevMBB, MBB, CurMBB);
                }
                CurMBB->addSuccessor(MBB);
                TII->insertBranch(*CurMBB, MBB, nullptr, {}, DL);
                AnalyzeControlFlow(*CurMBB);

                if (FPBBI->IsLoopHeader) {

                    LLVM_DEBUG(dbgs()
                                       << ">> LOOPIFY FOR " << GetName(FPBBI->BB)
                                       << " @ " << GetName(CurMBB) << "\n");

                    assert(FPBBI->TripCount > 0);

                    // Make CurMBB the loop preheader
                    //  (This block is already anticipated for in the real loop by
                    //    CanonicalizeSensitiveLoop)
                    //
                    // Add instructions to the loop preheader that
                    //    o push the current value of the induction register on the stack
                    //    o initialize the induction register
                    auto Preheader = CurMBB;
                    CurBBI->IsCanonicalLoopBlock = true;
                    auto T = Preheader->getFirstTerminator();
                    assert(T != nullptr);
                    BuildMI(*Preheader, T, DL, TII->get(MSP430::PUSH16r), IReg);
                    BuildMI(*Preheader, T, DL, TII->get(MSP430::MOV16rc), IReg).addImm(0);

                    // Create a new CurMBB and put it between the preheader and MBB blocks
                    CurMBB = CreateMachineBasicBlock("align-fp-preheader", true);
                    CurBBI = GetInfo(*CurMBB);
                    CurBBI->Orig = CloneMBB(CurMBB, false);
                    CurBBI->IsPartOfSensitiveRegion = true;
                    assert(Preheader->succ_size() == 1);
                    ReplaceSuccessor(Preheader, MBB, CurMBB);
                    CurMBB->addSuccessor(MBB);
                    TII->insertBranch(*CurMBB, MBB, nullptr, {}, DL);
                    AnalyzeControlFlow(*CurMBB);

                    // CurMBB will act as the loop header
                    CurBBI->IsLoopHeader = true;
                    CurBBI->TripCount = FPBBI->TripCount;

                    Headers.push_back(CurMBB);
                }

                // Align non-terminating instructions
                // TODO: assert(noNonTerminatingInstructions(CurMBB);
                //    => otherwise, contents of FPMBB might change because of this
                //             (violates principle that aligned regions cannot change
                //               anymore)
                FPBBI->IsAligned = false; // HACK (The fingerprint represents an
                //          aligned region, so safe to do)
                // (Aligned regions should not change anymore)
                AlignNonTerminatingInstructions({FPMBB, CurMBB}, UnusedReg);
                FPBBI->IsAligned= true;

                if (! FPBBI->IsLoopLatch) {
                    // Align/fix terminating instructions (see paper on how to fix this)
                    // Every block in the *aligned* loop region
                    //    either ends with exactly two terminating instructions
                    //    or either contains compensating instructions for two terminating
                    //    instructions (guaranteed by CanonicalizeTerminatingInstructions)
                    // !!!TODO: Hacky, there should be a more elgant way of dealing with
                    //      the (compensated) terminating instructions in the fingerprint
                    if (FPBBI->TerminatorCount != 1) {
                        auto T = CurMBB->getFirstTerminator();
                        if (FPBBI->TerminatorCount == 0) {
                            T--;
                            T->removeFromParent();
                        }
                        else {
                            assert(FPBBI->TerminatorCount == 2);
                            BuildNOPBranch(*CurMBB, T, TII);
                        }
                    }
                }
                else {
                    // A Canonical latch always end in two terminators
                    assert(! Headers.empty());
                    auto Header = Headers.back();
                    assert(Header != nullptr);
                    Headers.pop_back();
                    auto HeaderBBI = GetInfo(*Header);

