SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
                    CurBBI->IsLoopLatch = true;

                    // Create the loop-exit block
                    auto Exit = CreateMachineBasicBlock("align-fp-exit", true);
                    auto ExitBBI = GetInfo(*Exit);
                    ExitBBI->Orig = CloneMBB(Exit, false);
                    ExitBBI->IsPartOfSensitiveRegion = true;
                    ExitBBI->IsCanonicalLoopBlock = true;
                    ExitBBI->IsAligned = true;

                    // Connect latch to exit and header blocks
                    auto BrCond = MachineOperand::CreateImm(MSP430CC::CondCodes::COND_L);
                    CurMBB->replaceSuccessor(MBB, Exit);
                    CurMBB->addSuccessor(Header);
                    RemoveTerminationCode(*CurMBB);
                    TII->insertBranch(*CurMBB, Header, Exit, BrCond, DL);
                    ReAnalyzeControlFlow(*CurMBB);

                    // Connect exit to MBB
                    Exit->addSuccessor(MBB);
                    TII->insertBranch(*Exit, MBB, nullptr, {}, DL);
                    AnalyzeControlFlow(*Exit);

                    // Restore the value of the induction register in the exit block
                    BuildMI(*Exit, Exit->begin(), DL, TII->get(MSP430::POP16r), IReg);

                    // Replace the two instructions preceding the terminators
                    auto T = CurMBB->getFirstTerminator();
                    auto MI1 = --T;
                    auto MI2 = --T;
                    T = CurMBB->getFirstTerminator();
                    MI1->removeFromParent();
                    MI2->removeFromParent();
                    BuildMI(*CurMBB, T, DL, TII->get(MSP430::ADD16rc), IReg)
                            .addReg(IReg)
                            .addImm(1);
                    BuildMI(*CurMBB, T, DL, getCompareInstr(TII, HeaderBBI->TripCount), IReg)
                            .addImm(HeaderBBI->TripCount);

                    CurMBB = Exit;
                }

                PrevMBB = CurMBB;
            }
        }

        assert(Headers.empty());
        assert(PrevMBB != nullptr);

        Result.push_back(PrevMBB);
    }

    RedoAnalysisPasses(); // TODO: Optimize (see remark at function definition)

    LLVM_DEBUG(dbgs() << "> successors: ");
    LLVM_DEBUG(for (auto MBB: Result) dbgs() << GetName(MBB) << ", ");
    LLVM_DEBUG(dbgs() << "\n");

    return Result;
}

// AlignSensitiveLoop performs the following actions:
//  1) aligns all sensitive regions for which the "closest" loop is 'this' loop
//  2) Aligns all MBBs with the aligned loop region
//
//  It recursively deals with nested loops.
//
// Returns the list of successors of all the loop regions, including the newly
//  ceated ones. This is required for the next call to ComputeSuccessors to
//  compute the successors based on the correct set.
//
// Remark: AlignSensitiveLoop is mutually recursive with AlignSensitiveBranch
//
// Remark: Recomputes analysis passes
std::vector<MachineBasicBlock *>
MSP430DMADefenderPass::AlignSensitiveLoop(MachineLoop *Loop,
                                              std::vector<MachineBasicBlock *> MBBs) {
    // Get necessary loop information
    // AlignContainedRegions (below) and loopification (below) invalidates loop
    // analysis. Also, loop analysis seems to depend on CFG and/or termination
    // code.
    auto LoopPreheader = Loop->getLoopPreheader();
    auto Header = Loop->getHeader();
    auto LoopLatch = Loop->getLoopLatch();
    auto ExitBlock = Loop->getExitBlock();

    // Verify wel-formedness criterion
    assert(LoopPreheader != nullptr);
    assert(Header != nullptr);
    assert(LoopLatch != nullptr);
    assert(ExitBlock != nullptr);
    assert(LoopLatch->isSuccessor(ExitBlock));
    assert(*LoopPreheader->succ_begin() == Header);

    // First align the contained regions (no straigh-line code) of this loop,
    //  because an aligned loop region is a precondition for GetFingerprint.
    AlignContainedRegions(Loop); // Recomputes analyses passes
    Loop = getLoopForHeader(MLI, Header);
    assert(LoopLatch == Loop->getLoopLatch());

#if 0
    assert(Loop->getExitBlock() != nullptr);
  auto BBIE = GetInfo(*Loop->getExitBlock());
  //BBIE->IsAligned = true;
#endif

    // GeFingerprint depends on a correct loop analysis (see comments above)
    return AlignFingerprint(GetFingerprint(Loop), MBBs);
}

void MSP430DMADefenderPass::RedoAnalysisPasses() {
    // !LTODO: It might be better to "maintain" the Loop information and the
    //   dominator tree instead of redoing the complete analysis over and over again
    //    (see for example MLI::addBasicBlockToLoop() which seems to exist for this)
    // TODO! How to enforce a re-anlysis of MLI and all passes it depends on in
    //        a cleaner and more automated and less hardcoded way
    //MF->viewCFG();
    MDT->runOnMachineFunction(*MF); // MLI depends on this
    //MPDT->runOnMachineFunction(*MF);
    //MDT->dump();
    MLI->runOnMachineFunction(*MF); // !!TODO: Is this the right way to do this?
}

// This function checks whether any general purpose register is used in the given BasicBlocks
// of some sensitive region.
// It returns the first register that is found not to be used in the given BB, starting from R4.
Register MSP430DMADefenderPass::FindUnusedRegisters(std::vector<MachineBasicBlock *> BBs) {
    bool used[12] = {false, false, false, false, false, false, false, false, false, false, false, false};
    for (MachineBasicBlock *BB : BBs){
        for (auto it = BB->instr_begin(); it != BB->instr_end(); ++ it ) {
            std::pair<bool,bool> testR4 = (*it).readsWritesVirtualRegister(MSP430::R4);
            std::pair<bool,bool> testR5 = (*it).readsWritesVirtualRegister(MSP430::R5);
            std::pair<bool,bool> testR6 = (*it).readsWritesVirtualRegister(MSP430::R6);
            std::pair<bool,bool> testR7 = (*it).readsWritesVirtualRegister(MSP430::R7);
            std::pair<bool,bool> testR8 = (*it).readsWritesVirtualRegister(MSP430::R8);
            std::pair<bool,bool> testR9 = (*it).readsWritesVirtualRegister(MSP430::R9);
            std::pair<bool,bool> testR10 = (*it).readsWritesVirtualRegister(MSP430::R10);
            std::pair<bool,bool> testR11 = (*it).readsWritesVirtualRegister(MSP430::R11);
            std::pair<bool,bool> testR12 = (*it).readsWritesVirtualRegister(MSP430::R12);
            std::pair<bool,bool> testR13 = (*it).readsWritesVirtualRegister(MSP430::R13);
            std::pair<bool,bool> testR14 = (*it).readsWritesVirtualRegister(MSP430::R14);
            std::pair<bool,bool> testR15 = (*it).readsWritesVirtualRegister(MSP430::R15);
            if (testR4.first || testR4.second) {
                used[0] = true;
            } else if (testR5.first || testR5.second) {
                used[1] = true;
            } else if (testR6.first || testR6.second) {
                used[2] = true;
            } else if (testR7.first || testR7.second) {
                used[3] = true;
            } else if (testR8.first || testR8.second) {
                used[4] = true;
            } else if (testR9.first || testR9.second) {
                used[5] = true;
            } else if (testR10.first || testR10.second) {
                used[6] = true;
            } else if (testR11.first || testR11.second) {
                used[7] = true;
            } else if (testR12.first || testR12.second) {
                used[8] = true;
            } else if (testR13.first || testR13.second) {
                used[9] = true;
            } else if (testR14.first || testR14.second) {
                used[10] = true;
            } else if (testR15.first || testR15.second) {
                used[11] = true;
            }
        }
        /*int reg = 0;
        for(int i = 11; i >= 0;  i--) {
            if (used[i] == false) { reg = i; }
        }*/
    }

