SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    auto iter = std::find(used, used + 12, false);
    switch (std::distance(used,iter)) {
        case 0: return MSP430::R4;
        case 1: return MSP430::R5;
        case 2: return MSP430::R6;
        case 3: return MSP430::R7;
        case 4: return MSP430::R8;
        case 5: return MSP430::R9;
        case 6: return MSP430::R10;
        case 7: return MSP430::R11;
        case 8: return MSP430::R12;
        case 9: return MSP430::R13;
        case 10: return MSP430::R14;
        case 11: return MSP430::R15;
    }
}

// Aligns the sensitive branch that starts with BBI.BB
//
// When this function returns,
//   the sensitive branch defined by (BBI.BB, ExitOfSR) will be secure. All
//   possible paths in the region will have same fingerprint. This means that
//   the complete region will be compensated for
//     - unbalanced non-terminating instructions
//     - unbalanced terminating instructions
//     - unbalanced two-way branches
// Consequently, GetFingerprint() will return the correct fingerprint.
//
// Remark: Recomputes analysis passes
void MSP430DMADefenderPass::AlignSensitiveBranch(MBBInfo &BBI) {
#if 0
    switch (BBI.BClass) {
    case BCFork:
      AlignFork(BBI);
      break;
    case BCDiamond:
      AlignDiamond(BBI);
      break;
    case BCTriangle:
      AlignTriangle(BBI);
      break;
    case BCNotClassified:
      // ! TODO Enable this again
      llvm_unreachable("Unclassfied branch pattern");
      break;
    default:
      llvm_unreachable("Unknown branch pattern");
  }
#endif

    auto ExitOfSR = GetExitOfSensitiveBranch(BBI.BB);
    LLVM_DEBUG(dbgs() << "=== Align sensitive branch (" << GetName(BBI.BB) << ", "
                      << GetName(ExitOfSR) << ") ===\n");

    assert(!BBI.IsAligned);

    std::vector<MachineBasicBlock *> MBBs; // Keep track of aligned blocks

    // 1) Align non-terminating instructions
    Successors Succs;
    Succs = ComputeSuccessors({BBI.BB}, ExitOfSR);
    Register UnusedReg = FindUnusedRegisters(Succs.Succs);



    while (!Succs.Succs.empty()) {


#if 0
        MF->viewCFGOnly();
    getchar();
#endif

        // TODO: Make sure this loop terminates
        if (Succs.Loop == nullptr) {
            assert(Succs.Succs.size() > 1);
            AlignNonTerminatingInstructions(Succs.Succs, UnusedReg);
            std::copy(Succs.Succs.begin(), Succs.Succs.end(), std::back_inserter(MBBs));
            Succs = ComputeSuccessors(Succs.Succs, ExitOfSR);
            UnusedReg = FindUnusedRegisters(Succs.Succs);
        }
        else {
            // A loop has been detected by ComputeSuccessors, deal with it first
            auto S = AlignSensitiveLoop(Succs.Loop, Succs.Succs);

#if 1
            auto E = Succs.Loop->getExitBlock();
            assert(E != nullptr);
            auto BBIE = GetInfo(*E);
            BBIE->IsAligned = true;
#endif

#if 0
            // CanonicalizeTerminatingInstructions is already called in
      //   CanonicalizeSensitiveLoop for loop headers
      auto H = Succs.Loop->getHeader();
      assert(H != nullptr);
      MBBs.push_back(H);
#endif

            Succs = ComputeSuccessors(S, ExitOfSR);
            Register UnusedReg = FindUnusedRegisters(Succs.Succs);
        }
    }

    // 2) Canonicalize terminating instructions
    for (auto MBB : MBBs) {
        MBBInfo *BBI = GetInfo(*MBB);

        assert(BBI->IsAligned);

        // Aligning the termination instructions should be done after aligning
        // the non-termination instructions of all MBBs in the sensitive branch.
        // This is because the termination code can still change when aligning
        // one of the successor blocks (e.g. when an empty block is inserted).
        CanonicalizeTerminatingInstructions(BBI->BB);
    }

    // 3) Align two-way branches
    MBBs.push_back(BBI.BB); // Don't forget to include the entry block
    for (auto MBB : MBBs) {
        MBBInfo *BBI = GetInfo(*MBB);

        // Aligning two-way branches should be done after aligning the
        // non-terminating instructions because the instruction that gets inserted
        // in the true path, to compensate for the JMP in the false path,
        // does not have to be taken into account when aligning the MBBs at the
        // same level (See AlignNonTerminatingInstructions), because technically
        // this compensating
        // instruction belongs the previous MBB (or you could say that it is an
        // artifact of how two-way branches need to be represented in MIR).
        if (IsTwoWayBranch(BBI)) {
            AlignTwoWayBranch(*MBB);
        }
    }

    LLVM_DEBUG(dbgs() << "=== Done ===\n");

    RedoAnalysisPasses(); // TODO: Optimize (see remark at function definition)
}

void MSP430DMADefenderPass::AnalyzeLoops() {
    for (auto &KV : BBAnalysis) {
        MBBInfo &BBI = KV.second;
        if (BBI.IsPartOfSensitiveRegion) {
            auto L = MLI->getLoopFor(BBI.BB);
            if ( (L != nullptr) && (BBI.BB == L->getHeader())) {
                // Verify wel-formedness criterion for loops
                // LTODO: check all constraints
                assert(L->getLoopPreheader() != nullptr);
                assert(L->getHeader() != nullptr);
                auto Latch = L->getLoopLatch();
                assert(Latch != nullptr);
                assert(L->getExitBlock() != nullptr);
                assert(L->getLoopLatch()->isSuccessor(L->getExitBlock()));
                assert(*L->getLoopPreheader()->succ_begin() == L->getHeader());

#if 0
                // !!TODO
        // Check some constraints of the well-formedness criterion
        // Latch should end with a conditional jump, followed by an
        //   unconditional jump
        assert(std::distance(Latch->terminators().begin(),
                             Latch->terminators().end()) == 2);
#endif

                // LTODO: Document this better
                // Register that this block is the header of a loop.
                // In the nemdef pass, loops are represented by their header-MBB, a
                // property for loops that is invariant in this pass. (The preheader
                //  and exit blocks can be different before and after the
                //  transformation.)
                // Loop data structures retured by MLI are invalidated when
                //  loop analysis is recomputed. For this reason, it is not safe
                //   to store loop pointers in nemdef data structures since they
                //    can become dangling.
                // The nemdef transformation does not always preserves the
                //  well-formedness criterion. ComputeTripCount for example
                //  expects that the initialization of the induction register
                //  occurs in the preheader block. However, nemdef might introduce
                //  an new "artificial" loop between the preheader of a
                //  well-formed loop and the actual loop
                //   (see nemdef-loop-loop-tail-O3 for example)
                BBI.IsLoopHeader = true;

