SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
                // Compute the loop trip count. According to the well-formedness
                // criterion this should be statically computable.
                BBI.TripCount = GetLoopTripCount(L);

                GetInfo(*Latch)->IsLoopLatch = true;
            }
        }
    }
}

// POST: A sensitive branch is an outer sensitive branch iff
//        its entry MBB's BBInfo has its IsPartOfSensitiveRegion flag not set
// TODO: Verify correctness of this (unit tests)
//        especially how this functions deals with loops in the CFG and
//        with overlapping regions
void MSP430DMADefenderPass::DetectOuterSensitiveBranches() {

    std::vector<std::pair<MachineBasicBlock *, MachineBasicBlock *>> MBBs = {
            {EntryBBI->BB, nullptr}
    };

    std::set<MachineBasicBlock *> Visited;

    Visited.insert(EntryBBI->BB);
    while (! MBBs.empty()) {
        MachineBasicBlock *MBB, *endOfCurrentRegion;
        std::tie(MBB, endOfCurrentRegion) = MBBs.back();
        MBBs.pop_back();

        if (endOfCurrentRegion == nullptr) {
            if (IsSecretDependent(GetInfo(*MBB))) {
                endOfCurrentRegion = GetExitOfSensitiveBranch(MBB);
            }
        }

        for (auto S : MBB->successors()) {
            // Avoid endless loop when CFG contains a loop
            if (Visited.find(S) == Visited.end()) {
                Visited.insert(S);
                if ( (endOfCurrentRegion == nullptr) || (S == endOfCurrentRegion) ) {
                    MBBs.push_back({S, nullptr});
                } else {
                    MBBs.push_back({S, endOfCurrentRegion});
                    //LLVM_DEBUG(dbgs() << GetName(S) << " is part of sensitive region\n");
                    GetInfo(*S)->IsPartOfSensitiveRegion = true;
                }
            }
        }
    }
}

// Replaces the call to a call of the secure version of the callee
void MSP430DMADefenderPass::SecureCall(MachineInstr &Call) {
    DebugLoc DL; // FIXME: Where to get DebugLoc from?

    assert(Call.isCall());

    std::string * N = new std::string(); // TODO: Fix mem leak ?

    MachineOperand &MO = Call.getOperand(0);
    switch (Call.getOpcode()) {
        case MSP430::CALLi:

            switch (MO.getType()) {
                case MachineOperand::MO_ExternalSymbol:
                    N->append(MO.getSymbolName());
                    break;
                case MachineOperand::MO_GlobalAddress :
                    N->append(std::string(MO.getGlobal()->getName()));
                    break;
                default:
                    llvm_unreachable("Usupported machine operand");
            }

            // TODO: Avoid string manipulation
            if (N->find(PREFIX_NEMDEF_SECURE) > 0) {  // Read as: "if not startswith"
                if (N->find(PREFIX_NEMDEF_DUMMY) > 0) { // Read as: "if not startswith"
                    N->insert(0, PREFIX_NEMDEF_SECURE);
                    MO.ChangeToES(N->c_str());
                }
            }

            break;

#if 0
            // !!!!TODO: Sancus out calls
    case MSP430::BRCALLr:
      break;
#endif

        case MSP430::CALLm:
        case MSP430::CALLn:
        case MSP430::CALLp:
        case MSP430::CALLr:
        default:
            LLVM_DEBUG(dbgs() << "OPCODE=" << Call.getOpcode() << "\n");
            LLVM_DEBUG(dbgs() << Call);
            llvm_unreachable("Usupported call");
    }
}

void MSP430DMADefenderPass::SecureCalls() {
    for (auto &&KV : BBAnalysis) {
        MBBInfo &BBI = KV.second;
        if (BBI.IsPartOfSensitiveRegion) {
            for (auto &MI : *BBI.BB) {
                if (MI.isCall()) {
                    SecureCall(MI);
                }
            }
        }
    }
}

// For every pattern, a corresponding alignator exists
void MSP430DMADefenderPass::AlignSensitiveBranches() {
    //MF->viewCFG();

    // Keep track of original contents to be able to clone the original
    // when necessary.
    // !!TODO: When keeping track of the original, keep track of
    //          the original successors as well !!
    // TODO: Optimize - There is no need to keep a copy of the original
    //                   contents for every MBB
    for (auto &&KV : BBAnalysis) {
        MBBInfo &BBI = KV.second;
        BBI.Orig = CloneMBB(BBI.BB, false);
        assert(BBI.Orig != nullptr);
    }

    // 1) Align outer sensitive branches
    for (auto &&KV : BBAnalysis) {
        MBBInfo &BBI = KV.second;
        // BBI.IsPartOfSensitiveRegion makes sure that only
        // outer sensitive branches will be considered here
        // (Note that this is not the same as "overlapping sensitive regions")
        if (IsSecretDependent(&BBI) && (! BBI.IsPartOfSensitiveRegion) ) {
            //! TODO this is work that also 'AlignSensitiveBranch()' does...
            auto ExitOfSR = GetExitOfSensitiveBranch(BBI.BB);
            Successors Succs;
            Succs = ComputeSuccessors({BBI.BB}, ExitOfSR);
            //! TODO: Make this a set of unused registers and delete UnusedReg. The remaining regs can be used in
            //! CheckAccessedMemoryRegions()
            Register UnusedReg = FindUnusedRegisters(Succs.Succs);
            CheckAccessedMemoryRegions(Succs.Succs, TII, UnusedReg);

            // MOV #0x0402, RUnused
            auto I = BBI.BB->begin();
            for ( ; I != --BBI.BB->end(); ++I) {}
            BuildMI(*(BBI.BB), --I, BBI.BB->findDebugLoc(BBI.BB->end()),
                    TII->get(MSP430::MOV16rc), UnusedReg).addImm(0x0402);
            AlignSensitiveBranch(BBI);
        }
    }
}

#if 0
void MSP430DMADefenderPass::DumpDebugInfo() {
  LLVM_DEBUG(dbgs() << "============== INFO ====================\n");
  for (auto &MBB: *MF) {
    auto BBI = GetInfo(MBB);
    LLVM_DEBUG(dbgs() << GetName(&MBB)
        << " TerminatorCount=" << BBI->TerminatorCount
        << "\n");
  }
  LLVM_DEBUG(dbgs() << "========================================\n");
}
#endif

void MSP430DMADefenderPass::WriteCFG(std::string label)
{
#if !defined(NDEBUG)
    if (SaveCFG) {
        std::string Filename = MF->writeCFG();
        assert(!Filename.empty());
        std::ifstream Src(Filename, std::ios::binary);
        std::ofstream Dst(
                (MF->getName() + Twine(".", label) + ".dot").str(), std::ios::binary);
        Dst << Src.rdbuf();
    }
#endif
}

void MSP430DMADefenderPass::DumpCFG() {
    // TODO: Compare with the CFG build by LLVM, not applying the
    //        transformations of this pass (graphs should be isomorphic)
#if 1
    MF->viewCFG();
#else
    MF->viewCFGOnly();
#endif

