SteffieJoosen/llvm-project/llvm/lib/Target/MSP430/MSP430DMADefender.cpp
    int FD;
    auto FN = createGraphFilename(MF->getName(), FD);
    raw_fd_ostream O(FD, /*shouldClose=*/ true);
    // TODO: Use GraphWriter

    O << "digraph " << MF->getName() << "{\n";

    for (auto &&KV : BBAnalysis) {
        MBBInfo &BBI = KV.second;
#if 0
        if (BBI.IsEntry) {
      O << GetName(BBI.BB) << " [color=green];\n";
    }
#endif

        if (BBI.HasSecretDependentBranch) {
            O << GetName(BBI.BB) << " [color=red];\n";
        }

        if (BBI.IsAnalyzable) {
            if (BBI.IsBranch) {
                assert(BBI.TerminatorCount > 0);
                if (BBI.FalseBB) {
                    O << GetName(BBI.BB) << " ->" << GetName(BBI.FalseBB) << ";\n";
                }
                if (BBI.TrueBB) {
                    O << GetName(BBI.BB) << " ->" << GetName(BBI.TrueBB) << ";\n";
                }
            }
            if (BBI.TerminatorCount == 0) {
                assert(!BBI.IsBranch);
                assert(BBI.FallThroughBB != nullptr);
                O << GetName(BBI.BB) << " ->" << GetName(BBI.FallThroughBB) << ";\n";

            }
        } else {
            // Mark as un-analyzable
            O << GetName(BBI.BB) << " [color=purple];\n";
        }
    }

    O << "}\n";

    DisplayGraph(FN, false, GraphProgram::DOT);
}

void MSP430DMADefenderPass::PrepareAnalysis() {
    MF->RenumberBlocks();
#if 0  // Re-enable when BBAnalysis is a vector
    BBAnalysis.resize(MF->getNumBlockIDs());
#endif

    // Create dummy machine instructions at the beginning of the entry MBB to
    //  represent the CC defs. Add them to the sensitivity set when their corresponding
    //  argument is marked "_secret". This allows for a uniform and therefore
    //  simpler sensitivity analysis implementation.
    // TODO: Code is MSP430-specific and should be platform independent
    //        -> Possible use the generated info from the TableGen CallingConv
    //            backend?
    // TODO: Get rid of Reg++
    auto &MBB = *GetEntryMBB(MF);
    auto MBBI = MBB.begin();
    auto DL   = MBBI->getDebugLoc();
    int Reg   = MSP430::R12;
    // TODO: Stop after 4 iterations (for MSP430 at least)
    for (auto &Arg : MF->getFunction().args()) {
        auto MI = BuildMI(MBB, MBBI, DL, TII->get(MSP430::MOV16rc), Reg++).addImm(0);
        if (IsSecret(Arg)) {
            SensitivityInfo.insert(MI);
        }
    }
}

void MSP430DMADefenderPass::FinishAnalysis() {
    // Remove the dummy machine instructions at the beginning of the entry MBB,
    //  representing the CC defs
    auto MBB = GetEntryMBB(MF);
    auto MBBI = MBB->begin();
    for (size_t i=0; i<MF->getFunction().arg_size(); i++) {
        auto MI = &*MBBI++;
        MBB->remove(MI);
    }
}

// Canonicalizes the CFG when necessary (determined during sensitivity analysis).
// The canonicalization step transforms a CFG with multiple exit points into
// one where there is only one.
// TODO: Optimize
//        Now every return block is replaced with a branch block
//        while this is only required for return blocks in senstive regions
void MSP430DMADefenderPass::CanonicalizeCFG() {
    if (CanonicalExit != nullptr) {

        LLVM_DEBUG(dbgs() << "Canonicalize CFG\n");

        for (auto &MBB : *MF) {
            if (&MBB == CanonicalExit)
                continue;

            if (GetInfo(MBB)->IsReturn) {
                // Remove the return instruction, update CFG, termination code and
                // BBAnalysis
                DebugLoc DL; // FIXME: Where to get DebugLoc from?
                RemoveTerminationCode(MBB);
                MBB.addSuccessor(CanonicalExit);
                TII->insertBranch(MBB, CanonicalExit, nullptr, {}, DL);
                ReAnalyzeControlFlow(MBB);
            }
        }

        AnalyzeControlFlow(*CanonicalExit);

        // Don't forget to rebuild the post-dominator tree
        MPDT->runOnMachineFunction(*MF); // !!TODO: Is this the right way to do this?

        LLVM_DEBUG(dbgs() << "Canonicalization done\n");
    }
}

bool MSP430DMADefenderPass::runOnMachineFunction(MachineFunction &MF) {
    //if (skipFunction(MF.getFunction()))
    //  return false;
    if (!Enable)
        return false;

    LLVM_DEBUG(dbgs() << "********** " << getPassName() << " : " << MF.getName()
                      << "**********\n");

    HasSecretDependentBranch = false;
    bool Changed = false;
    const TargetSubtargetInfo &STI = MF.getSubtarget();
    this->MF = &MF;
    //TII=static_cast<const MSP430InstrInfo *>(MF.getSubtarget().getInstrInfo());
    //TLI = STI.getTargetLowering();
    MRI = &MF.getRegInfo();
    TII = STI.getInstrInfo();
    TRI = STI.getRegisterInfo();
    MLI = &getAnalysis<MachineLoopInfo>();

    if (!TII) return false;

    MDT = &getAnalysis<MachineDominatorTree>();
    MPDT = &getAnalysis<MachinePostDominatorTree>();

    // TODO: assert(!MRI->isSSA());

    WriteCFG("before");

    if (EmitCFG) {
#if 0
        MF.viewCFG(); // Dump unhardened CFG before any possible changes
#else
        MF.viewCFGOnly(); // Dump unhardened CFG before any possible changes
#endif
    }

    // Perform analysis
    PrepareAnalysis();
    AnalyzeControlFlow();
    VerifyControlFlowAnalysis();
    ComputeReachingDefs();

    PerformSensitivityAnalysis();
#if 0
    ClassifyBranches();
#endif
    FinishAnalysis();

    if (! HasSecretDependentBranch)
    {
        assert(! Changed);
        return Changed;
    }

    // Canonicalize CFG, if needed
    CanonicalizeCFG();

    if (EmitCFG) {
#if 0
        MF.viewCFG(); // Dump after canonicalization, before hardening
#else
        MF.viewCFGOnly(); // Dump after canonicalization, before hardening
#endif
    }

    // Analyses performed after canonicalization
    DetectOuterSensitiveBranches();
    AnalyzeLoops();

    // Generate hardening code
    //DumpDebugInfo();
    SecureCalls();
    AlignSensitiveBranches();
    //DumpDebugInfo();

    if (EmitCFG) {
        DumpCFG(); // Dump after hardening CFG
    }

    if (HasSecretDependentBranch)
        WriteCFG("after");

    return Changed;
}

void MSP430DMADefenderPass::releaseMemory() {
    BBAnalysis.clear(); // TODO: Does this also clear Defs and Deps?
    InstIds.clear();
    SensitivityInfo.clear();

    CanonicalExit = nullptr;
    EntryBBI = nullptr;
    HasSecretDependentBranch = false;
}

#if 0
INITIALIZE_PASS_BEGIN(MSP430DMADefenderPass, DEBUG_TYPE,
                      "X86 cmov Conversion", false, false)
INITIALIZE_PASS_DEPENDENCY(MachineLoopInfo)
INITIALIZE_PASS_END(MSP430DMADefenderPass, DEBUG_TYPE,
                    "X86 cmov Conversion", false, false)
#endif
static RegisterPass<MSP430DMADefenderPass> X(DEBUG_TYPE,
                                                 "MSP430 DMA Defender Pass",
                                                 false /* Only looks at CFG */,
                                                 false /* Analysis Pass */);


FunctionPass *llvm::createMSP430DMADefenderPass() {
    return new MSP430DMADefenderPass();
}